{"3-notes-for-humans/pressure_valve":{"title":"3.10 Pressure cooker","links":[],"tags":[],"content":"Entropy tends to increase in the universe, disorder naturally grows over time. But disorder is messy. We don’t do well with disorder all the time. There’s one reason while people enjoy while on holidays but eventually feel some relief by coming home.\nDisorder is chaos, it’s inefficient, and in our history it proved to be as needed to foster progress as dangerous to those who lived through it. We strive all the time for certainty, for order. People tend to centralize things to maximize order.\nBut just like a pressure cooker without a safety valve, it boils too much until it explodes. Same goes for financial regulations. Same for tyrannical governments.\nPrivacy allows for usually meek individuals to opt out in silence and release some of that built pressure. Decentralizing what we do is inefficient, it’s messy, but also allows for all the pressure of being ourselves to dissipate more evenly, and not to build so much until we have a earthquake.\nA decentralized and private money makes change possible while keeping it safer, by fostering sincere financial voting and lowering the bar of accumulated pressure so instead of exploding, it releases."},"3-notes-for-humans/freedom_of_thought":{"title":"3.11 Freedom of thought","links":[],"tags":[],"content":"There is one freedom that nobody can take away from you, at any point of time. It is your freedom of thinking whatever you want.\nSomeone can force you to do anything, even kill yourself, but your innermost sanctuary is your own thought, your own beliefs. This is true, as far as we can keep thinking, we can keep thinking whatever we want.\nBut there has always been a danger lurking. Even though nobody can force us to think something, we’re relatively easy to persuade. It’s even more powerful if we don’t notice it and we believe it was our idea all along. This happened forever, but one of the byproducts of getting better at everything as a society is that we also got better at developing mass persuading tools.\nThe most effective persuasion is done peer to peer. It’s a tailored persuasion by someone that knows us well and therefore knows were the unattended entrances are. Someone we care about, someone we listen to, someone we’d like to impress are the most powerful influencers we could face.\nAt the same time, the most economically effective persuasion is done in masse, of course. Any kind of propaganda, from public massive gatherings, speeches, news outlets, etc. You centralize the production of the message and get a lot of bang for your buck.\nNow, we got to a point where we managed to merge both aspects in one: algorithms. Technologies that are good at getting to know each of us personally and deciding what to show to us to get us to think something in particular. We have a massively deployed system that is planned centrally, yet feels personal. And the thing that makes it all possible is data.\nThe more data a system has about us, the better it gets at persuading us. Artificial intelligence is going to make telling the difference between our free choices and our steered choices way more difficult. The only solution is to feed it less data.\nAnd when it comes to money, only a private form of money is going to protect our usage patterns from being weaponized against us. If we want a humane society, with all the pros and cons it entails, we need to adopt such money. The other option is to slowly then faster descend into a mindless, efficient society where there’s no room left for anything but a shapeless blob of grey human pureé.\nFreedom is a mixed bag, comes with personal victories and hurtful mistakes. But that’s how we managed to be here now."},"3-notes-for-humans/wake_up":{"title":"3.1 Wake up","links":["3-notes-for-humans/savings"],"tags":[],"content":"You’re laying on the floor. You smell of burnt ash, grease, and sweat. The noise of the nearby stream reaches you, faint through the foliage and bounces on the entrance of the cove. You can see morning light beams dancing outside, filtered by the foliage. Next to you lies your family, which doesn’t mean the same as it means today. You rise up. You’re not fit, but you’re certainly streamlined. Your body has no excess, all the energy you managed to get in the past has been used to keep going. Your muscles sore from yesterday’s foraging. Your body looks way older than you’d think, based on the years you’ve been alive. Compared to your future descendants, your lifetime is compressed.\nYou know what’s the next thing you’re going to do. You don’t have to think, and your body is telling you anyways. You have to get food.\nMost of your waking hours are dedicated to get food. You could argue the same is conceptually true today. However, this is not merely conceptual, it’s actually looking for, finding, killing or stealing food. You do little else before getting too tired and asleep. Probably mating from time to time, otherwise we wouldn’t be here in the future, writing and reading about it. Very little time is left of your waking hours to anything else that isn’t securing enough fuel so you can do the same the next day. And the next. You’re truly living day-to-day.\nTime to achieve anything new, to try an idea out, to fail, was the scarcest thing around. You’d have to be really good spotting edible fruits and berries, or really good at catching and killing animals with little or no tools available to have extra time.\nToday is a very important day. Inside a bush you feel like you checked a thousand times, there was an inner branch full of beautifully red berries. A hidden, precious pocket of edible fuel in the form of sugar. You grab them, quickly, and eat four of them. How lucky of you. You still have another four left. You’re very smart, so a faint thought forms in the back of your mind: if you don’t eat them now, tomorrow can be as good as a day as today. Tomorrow. That mythical day that doesn’t exist but then, when you wake up again, it does. This is huge. No, really, this is really huge.\nYou invented long time preference. This is the cornerstone of civilization. The ability to think for your future. Some time in the past, our brains got used to the idea of waking up each day, and seeing that the leftovers of last night’s dinner were still there. And that we could eat them, and therefore today you were less hungry because of the food you left yesterday.\nSo you go into the cave, look for a normal-looking stone, and hide the berries below it, inside a folded leave. Today’s the day that for the first time, you saved."},"3-notes-for-humans/savings":{"title":"3.2 Saved","links":["3-notes-for-humans/wake_up","2-blueprint-for-geeks/money_is_a_battery","2-blueprint-for-geeks/money_rules"],"tags":[],"content":"At first, having more of something than what you needed was an accident. Either by having luck and finding food laying around, managing to kill an animal bigger than expected, or plain stealing it from someone else. But there wasn’t much incentive to have extra anything, most of if was perishable and therefore got stale very fast, or if it was something durable like a tool or extra clothing, it was a burden to transport.\nOn top of that, everything you have in excess makes you a target, so there’s a risk associated with having something extra. It wasn’t like trading with other was super easy either, finding something that you need and the other person don’t, and at the same time something else that works the other way around, is super tricky. That left others in need of your thing with no other resource but to steal it from you, and if you stand in the way of that, attacking you.\nThis was not super cool for us, a bunch of standing mammals with oversize brains. Just like we started to invent language to be able to tell each other complicated stuff, and communicate things that weren’t happening in that precise moment, we ended up inventing money. Money at its core is nothing else but a tool to save that extra something we don’t need right now. If everybody else uses the same money, we can agree that this money is going to be accepted between us in the future. What starts to happen organically, is that if I manage to have more food than I need today, I trade that food for money, the other person gets to eat, and next week, maybe I’m a bit sick and unable to hunt for myself, but I can trade that money again and eating anyway.\nThe act of saving was already possible in some ways, but inventing money supercharged it. People started to realized that it was a better survival strategy to get very good at something that others needed but weren’t so good at. If you are a generalist and therefore a bit good at everything, the moment you can’t perform (because you’re ill for example) or the conditions get above your skill (harder prey to hunt), you’re doomed. But if you are the best medic of the group, you don’t need to even hunt, you can trade your skills for money, and when you need food, that money for food.\nSaving made us specialize. And with specialization, we went from basic mode to advance. We developed better tools to make our specialized work even more efficient, better communications to be able to reach further and further away, and thanks to those advances, we died less often.\nOne of those tools we made better and better every time was money itself. Money allowed more and more efficient trading and saving, is one of the technologies that made so many of us being here today possible. So if we can keep inventing better money, we can keep propelling ourselves to better lives."},"3-notes-for-humans/is_this_money":{"title":"3.3 Is Monero money?","links":["2-blueprint-for-geeks/good_money"],"tags":[],"content":"Yes it is.\nDon’t get lost in philosophic or etymological discussions. If it walks and talks like a duck, it’s probably a duck. If you earned it with your work, and you saved it for a while, and you spend it to buy something else, then it works like money. And something that works like money is… you guessed it: money.\nUse your scarce time on this planet to breathe, not argue if we should call the air… air."},"3-notes-for-humans/personal_choice":{"title":"3.4 A personal choice","links":[],"tags":[],"content":"A transaction should be a personal choice. Giving something out should be something an individual decides to do willingly.\nFor that to the true, the individual must have ownership of the thing to be given.\nTo have true ownership, both the person and the asset have to be resistant to censorship.\nTo be censorship-resistant, both secrecy and freedom are required.\nFor the person, secrecy means nobody knows who you are, therefore nobody can force you to do anything against your will. Freedom means you can move freely from place to place, in case someone wants to force you by not giving you any other option.\nFor the asset, secrecy means nobody can see the transaction and follow it back to you, voiding the previous point. Freedom means self-custody, so nobody can spend or use your funds without even needing to force you in the first place.\nIf we lose the previous properties, then it’s not a choice. If it’s not a choice, more often than not it won’t be aligned to our own interests. If we multiply that by millions, we end up with a few powerful individuals deciding for the rest of us.\nThe probability of most of us being happy in such scenario is very small. So, we need to work towards maintaining such sentence a reality: A transaction should be a personal choice."},"3-notes-for-humans/fresh_start":{"title":"3.5 A fresh start","links":["3-notes-for-humans/personal_choice","3-notes-for-humans/trying_things","2-blueprint-for-geeks/value_vs_price"],"tags":[],"content":"The internet gave us freedom to explore being someone else. Then, and only willingly, bring that new self back into the real world, updated. A different identity is a tool we can use to change our current one.\nIt’s like gaining higher ground to see what may be ahead and deciding if a path is better for us or not. Being private reduces friction from trying. It’s like asking for a time out in the middle of a match and consider your options.\nIdentities formed in base of our true desires and interests will foster connections to people that make our lives better for us, to jobs that are a genuine fit for us, to knowledge that boosts our chances to feel our lifes balanced, and worth living.\nThese identities have the chance to spill over, either gradually or in a sweep, to our meat space identities.\nIf all those interactions are monitored, we face having too much risk and not daring to try. Or make it very difficult to even create such identity because of its ties to our current one.\nAnd if money is the language of value, private money ensures that valuation censorship is gone and we can add money to the toolbelt of that new identity."},"3-notes-for-humans/trying_things":{"title":"3.6 Trying things out","links":["3-notes-for-humans/honest_opinion","3-notes-for-humans/wisdom_of_the_crowd"],"tags":[],"content":"The first picture that comes to our minds when we think about censorship is censorship by force.\nAn evil Orwellian government sending the police to knock down the doors of those who do not comply with the current speech law, regardless of that law being good or bad.\nBut there’s a less discussed yet maybe even more pervasive phenomenon, self-censorship. When we’re being observed, we behave differently. Privacy is the freedom to try things out.\nIn many ways, we already live inside the Truman Show. Once you realize that, how much would you stop being yourself? How many things would you like to try, but won’t because of that peer pressure?\nWhy is this important? Because trying stuff is essential to discover new things. Even AI works like this. It makes errors all the time and corrects course until it finds an outcome that works. AI improves so far because it’s not only a tireless human, it’s a shameless human.\nBut trying things in the clear, completely naked, set the risk too high for most people. Is that ability to try new things in a permission-less way (that means without the approval of someone already more powerful than us) makes us resistant to central planning.\nThat decentralizes things. Decentralization is important for optimizing the outcome of our very lives. Nobody is individually perfect. But collectively we get closer to getting things right.\nIn the future, more and more of that aggregated set of guesses will be recorded and analyzed. They will be part of our profiling, and we will be very aware of that. That will cause us to not answer truthfully individually. And so we’ll get it wrong collectively.\nWe’re voting all the time with our money.\nWe already learned that anonymous voting is the best voting.\nWe need to preserve that anonymous voting when it comes to our money.\nBecause that right to be wrong more often, will allow us to get it right together."},"3-notes-for-humans/honest_opinion":{"title":"3.7 Honest opinion","links":["3-notes-for-humans/wisdom_of_the_crowd"],"tags":[],"content":"In the Asch conformity experiments they put a person in a room together with other seven fake participants. Just like a ring signature, one true mixed up with many decoys Then they show them all a picture with three vertical lines of very obvious different lengths, and ask: ¿What line is equal to the first line, A, B or C?\nEven though there’s a clear correct answer, if the fake participants answer out loud first, and say A for example, the real participant answering last, will give the same wrong answer a third of the time. If you run the experiment 12 times, 75% of them conform to the peer pressure at least once.\nIt proved that we care a lot not to go against the current. We love validation from the group. We don’t want to stand out. It may even prove that some people actually believed they were seeing lines wrong.\nThink about it and the way that people would behave on a perfectly transparent spending paradigm. We’d go downhill very fast. We should aim for the right answer, not the most popular one."},"3-notes-for-humans/wisdom_of_the_crowd":{"title":"3.8 Wisdom of the crowd","links":["3-notes-for-humans/personal_choice","3-notes-for-humans/honest_opinion","2-blueprint-for-geeks/randomx","2-blueprint-for-geeks/good_money"],"tags":[],"content":"In the candy jar experiment, we fill a glass jar with a lot of candies or pebbles or anything that would be difficult to guess the number of by only looking. None of us is super accurate guessing how many candies are in the jar, but if we take the median of all our guesses, it’s impressively accurate. This candy jar experiment as been replicated with variants many many times, and the bigger the number of participants, the more accurate the guess gets.\nWhile this proves the wisdom of the crowd, it only works if everybody chooses freely. And one of the ways people won’t guess freely is peer pressure. We are guessing the value of things all the time. By buying and selling, either stuff or our time in a job, we’re broadcasting to each other how much we value what we have and what we want.\nOf course if we don’t even have permission to guess freely, it’s even worse. Monetary restrictions all over the world prove that again and again.\nOnly truly decentralized forms of money can look resistant to censorship, and only private forms of money can be truly resistant to censorship. A private, decentralized money is necessary for our collective wisdom to reach its potential."},"3-notes-for-humans/strings_attached":{"title":"3.9 The price of strings","links":["1-manual-for-users/send_monero","1-manual-for-users/gift_monero","2-blueprint-for-geeks/value_vs_price"],"tags":[],"content":"Giving money to someone should not have strings attached. When you gift with a money that allows you to trace everything the receiver does afterwards (and possible before the fact as well) is a poisoned gift.\nCan it be consider a gift, or are you just paying for information? The only way to avoid this is using an amnesic kind of money that doesn’t remember.\nForget about the gift. Let’s say you’re paying for something. If you’re getting something extra (the recipient’s financial information), what would be the fair price of that? Should you pay more for the privilege?\nIn that case, using money that is not private should be more expensive. Or putting it the other way around, pay with a private money should be cheaper than anything else."},"index":{"title":"Hoşgeldin","links":["1-manual-for-users/get_started","2-blueprint-for-geeks/lets_do_it","3-notes-for-humans/wake_up"],"tags":[],"content":"Kendini küçük ve paslı bir demir parmaklı kapıdan geçerken hayal et.\nKapı sonuna kadar açık, ve kapıdan geçerken sarı pirinç bir plaka\nüzerinde Monero Bahçesi yazan bir tabela görüyorsun.  Tanınmamış\nkuşlara ait hafif\nsesler\nkulaklarına varıyor, önünde rüzgarla eğilip açılan çimeni görüyorsun.\nİlk bakışta karmaşık bir örgü oluşturan desenler onlara tekrar\nbaktığın zaman üç ana kola ayrılan patikalara dönüşüyor.\nKullanıcılar için kılavuz\n(Nasıl kullanırım) Eğer ihtiyacın olan, nasıl çalıştığına bakmadan,\nne sebeple yaratıldığını anlamadan, sadece Monero’yu kullanmaksa,\nburadan başla.\nMeraklılar için proje planı\n(Nasıl çalışır) Bu patika seni tepeye çıkan yola götürüp Monero’nun\nnasıl çalıştığını gösterecek.  Haydi parça parça inceleyerek, sıfırdan\nbir sanal para yaratalım.\nİnsanlar için notlar\n(Neden onemli) Monero yeni bir dünyayı mümkün etmek için çok\nkullanışlı olan özelliklere sahip.  Bu patika senin aklını harekete\ngeçirecek.\n\nBu bahçede gezinmenin doğru veya yanlış yolu yok.  Önünde çakıl\ntaşlarıyla bezeli kuru topraktan üç patika var.  Etrafında daha önce\ngörmediğin yeşil bitkiler…  Patikaların kısa tariflerine göz\natarken içindeki merak duygusunun çoktan uyanmakta olduğunu\nhissediyorsun.\nTıkla sadece, ve keyfini çıkar."},"1-manual-for-users/mine_monero":{"title":"1.10 Mine it","links":["1-manual-for-users/getting_monero","1-manual-for-users/use_monero"],"tags":[],"content":"There’s another way to get your hands in some coins, in the most cypherpunk way possible. Monero is what’s called a proof-of-work cryptocurrency. That means that the system works in such a way that it gives out new coins to those who do a certain type of work, and can prove it.\nIn this case, you use your computer to run a program that makes very hard calculations all the time and you receive a little bit of Monero for that.\nAny computer can mine, but obviously, the faster the processor is, the more moneros you get in return. If your computer is too slow, it may not be profitable to mine instead of just buying the moneros, for example. That’s because your computer uses electricity to work, and since it’ll be working hard to earn moneros, the price of that electricity may be higher than the price of the moneros you get. This will change according to where you live, for example.\nSome people choose to mine anyway for different reasons. For one, it helps the network as a whole to be stronger against attacks, but also, because some people simply cannot buy Monero. For example they may be too young to have money of their own but they have a computer and they don’t pay the electricity bill. Or they live in a country where there are not many buying methods, or available sellers of Monero. Another possibility is that they have access to very cheap electricity.\nWhat you’ll need is a computer and a mining program. There are several available, but most people use XMRig. I suggest that you also check Gupax, which is an easy way to mine in a decentralized way. You download it, set it up, and start mining.\nThere is very good information about mining Monero at monerostuff.blogspot.com\nYou can also ask questions and read answers at the Monero Mining subreddit.\nOnce you get some coins, check out what you can do with them."}}