{"1-kullanicilar-icin-kilavuz/mine_monero":{"title":"1.10 Monero üret","links":["1-kullanicilar-icin-kilavuz/getting_monero","1-kullanicilar-icin-kilavuz/use_monero"],"tags":[],"content":"Monero elde etmenin başka bir yolu daha var.\nBu yöntem diğerleri arasında en şifrepunkçı olanı.  Monero,\nharcanan-iş-kanıtı niteliğinde bir kripto para.  Bu demektir ki,\nMonero’nun sistemi belirli çeşitte bir iş yaptığın zaman sana yeni\nkoinler verecek şekilde tasarlanmıştır.\nMonero’da, bilgisayarını kullanarak hesabı zor işlemler\ngerçekleştirirsin, ve karşılığında bir miktar monero elde edersin.\nHerhangi bir bilgisayar monero üretebilir, fakat elbette, işlemcin ne\nkadar hızlıysa o kadar çok monero elde edersin.  Eğer bilgisayarın çok\nyavaşsa, monero satın almak yerine monero üretmek kârlı olmayabilir.\nÇünkü bilgisayarın çalışırken elektrik tüketir, ve tükettiğin\nelektriğin fiyatı borsada monero satın aldığında ödeyeceğin miktardan\ndaha yüksek olabilir.  Bu durum yaşadığın yerin coğrafik konumuna göre\ndeğişebilir.\nKimileri, yine de, farklı sebeplerden dolayı monero üretmeyi\nseçebilir.  Öncelikle, monero üretmek, Monero ağının saldırılarına\nkarşı direncini artırır.  Bunun yanı sıra, kimilerinin monero satın\nalabilecekleri bir borsaya erişimleri olmayabilir.  Örneğin, kendi\nbanka hesaplarına sahip olamayacak kadar genç fakat elektrik\nfaturasını ödemeyen bir bilgisayara erişim olan kişiler olabilir.\nVeya, yaşadıkları ülkede monero satın alma seçenekleri kısıtli\nolabilir.  Bir diğer nedense, oldukça ucuz elektrik erişimlerinin\nolması olabilir.\nİhtiyacın olanlar bir bilgisayar ve bir monero üretimi programı.\nBunlardan birkaç tane bulunmakta, fakat bugün çoğu kişi\nXMRig kullanmakta.  Benim önerim\nGupax programına göz atman.  Bu program\nmerkeziyetsiz bir şekilde monero üretmeyi çok kolay hale sokuyor.  Onu\nbilgisayarına indiriyorsun, kurup başlatıyorsun, ve anında monero\nüretmektesin.\nMonero üretimi hakkında başka bir iyi kaynak burada da bulunmakta:\nmonerostuff.blogspot.com\nAyrıca soru sorup yanıtları okuyabileceğin bir monero üretimi\nsubreddit’i de mevcut.\nEline biraz koin geçtiğinde onlarla yapabileceklerine bir\nbak."},"1-kullanicilar-icin-kilavuz/receive_monero":{"title":"1.11 Al","links":["1-kullanicilar-icin-kilavuz/send_monero"],"tags":[],"content":"Sana monero yollayabilmesi için, diğer kişi içerisine yollayabileceği\nbir adrese ihtiyacı duyar, tipki e-posta gibi.\nMonero adresleri 95 haneli harf ve numaralar dizisinden oluşur, ve her\nzaman 4 veya 8 ile başlar.  Bu diziler tamamen rastgele değildirler,\nçünkü hatırla ki bunlar senin tohumlarından üretilirler.  Adresler\nşunun gibi görünür:\n88JiTX1ZuqXjEhVrxQRZBAX9VTBjzaBYUbh9Y85mL4Am7zkAVnDzxX4HMJdqSWcDMWSqyXShN9vuvYMySGTeYaRb3nc3H4w\nBunlar elle yazmak veya sesli okumak için oldukca uzun dizilerdir, ve\neğer bu adresleri kullanırken sen veya sana monero gönderen kişi bir\nhata yaparsa o monerolar tamamen başka bir yere gidecekler ve senin\nonlara erişimin olmayacak.  Bu yüzden adresleri bir yerlere aktarırken\nonları her zaman ya kopyala yapıştır, ya da karekod kullan.\nKendi adresini bulmak için cüzdanını aç ve Al (ing.: Receive)\nbutonuna bas.  Ardından orada kendi adresini göreceksin.  Onu basitçe\nbir mesajlaşma uygulamasına kopyala yapıştır, veya yanında bulunan\nkişiden monero almak için adresinin karekodunu ona göster.\nMerak etme, diğer kripto paraların aksine, Monero’da birisi senin\nadresini öğrendiği zaman senin ne kadar paraya sahip olduğunu veya\nkimlere para yollayıp kimlerden para aldığını göremez.  Bu saydam\nolmayan ve kilitli bir kutuya benzer: insanlar içine bir şeyler\nkoyabilir fakat içinde ne olduğunu veya kutunun kime ait olduğunu\nbilemezler.  Monero’nun güzelliği budur.  Sonuç olarak, Monero\nadresini özgürce paylaşmaktan çekinme.\nSenin adresine sahip olduktan sonra, diğerleri sana Monero göndermek\niçin bilmeleri gereken her şeye sahip olurlar.  Miktarda uzlaştıktan\nsonra beklemeye geç.  Yolladıklarında, senin cüzdanında gözükmesi bir\nkaç saniye sürebilir.  Gelen monerolar cüzdanında ilk defa\ngözüktükleri zaman beklemede (ing.: pending) olurlar.  Yaklaşık\niki dakika ardından gelen işlem durumu beklemeden onaylandı’ya\n(ing.: confirmed) dönüşür.  Bu demektir ki, sana gelen Monero\ngönderim işlemi en son Monero bloğu içerisine girmiştir ve geri\nalınamaz durumdadır.  İşlem tamam.\nMonero’nun çalışma şeklinden dolayı bu yeni gelen moneroları başka bir\nyere yollamadan önce 9 blok daha beklemen gerekir.  Bu yaklaşık 20\ndakika sürer.  Monero yollamayı şimdi\ndeneyelim!"},"1-kullanicilar-icin-kilavuz/send_monero":{"title":"1.12 Yolla","links":["1-kullanicilar-icin-kilavuz/mine_monero","1-kullanicilar-icin-kilavuz/use_monero"],"tags":[],"content":"Yollayan kişi sen olduğuna göre icine yollayacağın bir adrese\nihtiyacin var.  Diğer kişi seninle bu adresi bir mesaj içerisinde veya\nkarekodla paylaşacaktır.\nCüzdanını aç, ve Yolla (ing.: Send) butonunu seç.  Eline geçen\nadresi oraya yapıştır, veya karekodla oku.  Uygulama ona verdiğin\nadresin geçerli bir Monero adresi olup olmadığını doğrulayacak.  Bu\ndemektir ki, koyduğun adres 95 karakter uzunluğunda ve her zaman 4\nveya 8 ile başlayan bir dizi.\nSonra miktar (ing.: amount) girmen gerekecek.  Çoğu cüzdanlar\ngönderilen miktarı dolar veya avro biriminden girmene izin verecek, ve\narka planda senin yerine bu miktarı karşılığında monero miktarına\nçevirecektir.  Bu başkalarına kirli fiat para miktarında ödeme yapmak\nistediğin zaman işe yarayan bir özellik.\nSon adımda cüzdan sana yollama işleminin detaylarını sunacak.\nYolladığın adresin doğru olduğuna bir kere daha bak.  Adres doğru ise,\nyolladığın miktarın doğru olduğuna bir kere daha bak.  Her şey doğru\ngözüküyorsa, işlemi onayla.\nMonero göndermek her zaman monero üreticilerine ödenen küçük bir\nmiktar ücret içerir.  Bu aynı zamanda monero kazanmanın yollarından\nbiridir, eğer bu ilgini çekiyorsa nasıl monero üretebileceğine bir\nbak.\nCüzdan uygulaması içerisinde, işlem listesine geri döndüğünde, en son\nyolladığın işlemi göreceksin.  İlk olarak bu işlemin durumu\nbeklemede olacak, ancak yaklaşık iki dakika ardından durumu\nonaylandı olarak değişecek.  Bu demektir ki yolladığın Monero işlemi\nen son bloklardan birisine girdi, ve o moneroları artık geri\nalamazsın.\nAferin!  Artık nasıl yollayacağını bildiğine göre monerolarınla\nyapabileceğin şeylerin listesine bir bak."},"1-kullanicilar-icin-kilavuz/use_monero":{"title":"1.13 Monero kullan","links":["1-kullanicilar-icin-kilavuz/buy_with_monero","1-kullanicilar-icin-kilavuz/tip_monero","1-kullanicilar-icin-kilavuz/donate_monero","1-kullanicilar-icin-kilavuz/gift_monero","1-kullanicilar-icin-kilavuz/seed_storage"],"tags":[],"content":"Mükemmel!  Artık nasıl bir cüzdan yaratacağını, nasıl monero alıp\nyollayacağını biliyorsun.  Bunlar temel şeyler gibi görünüyor, ancak\ninan bana, bunlar kimileri için oldukca karmaşık şeyler.  Bu\nyetenekler seni çoktan seçkin şifrepanklar arasına sokar!\nMonerolarınla yapabileceğin bazı şeyler:\n\nBir şeyler satın al\nBahşiş al veya yolla\nHayır işlerine yolla\nSevdiklerine ver\n\nVeya, sadece elinde de tutabilirsin, gizlice ve\ngüvenli.  İleride elindeki zenginliği\nsaklayabilmenin tek yolu Monero’yu bu şekilde kullanmak olabilir.\nSadece internet erişimine ihtiyacın var.  Eger gelecekte bu bile\nerişim dışıysa…  İyi şanslar, ve tekrar okla avlanma pratiği yapsan\niyi olur."},"1-kullanicilar-icin-kilavuz/buy_with_monero":{"title":"1.14 Bir şeyler satın al","links":["1-kullanicilar-icin-kilavuz/use_monero","1-kullanicilar-icin-kilavuz/exchange_monero","1-kullanicilar-icin-kilavuz/tip_monero"],"tags":[],"content":"Monero kullanarak bir şeyler ödemek (kabul\nedildiği ortamlarda) oldukca keyifli bir deneyim.  Bir dakika\niçerisinde dünyadaki herhangi bir yerde herhangi bir kişiye ödeme\nyapabilirsin.  Eger bu kimliğini açık etmeden alabileceğin bir şeyse,\nMonero kullanmak özellikle işe yarar.\nİyi bir örnek ProxyStore’dur.  Bu Leipzig,\nAlmanya’da bulunan somut bir dükkandır, ve somut veya sanal ürünlerini\nsana gönderdikleri bir hizmeti Monero karşılığında sunmaktadırlar.\nIVPN ve Mullvad ikisi\nde oldukca iyi VPN hizmetleridir, ve kullanabilmen için senden bir\neposta adresi bile istemezler.\nTutanota gizlilik koruyan bir eposta\nhizmetidir.  Tamamen şifreli ve reklamsız.\nNjalla senin bir alan adı satın almanı veya bir\nsunucu sunmanı sağlayan, gizlilik koruyan bir hizmettir.\nEğer ABD veya Kanada’da yaşıyorsan Coincards\nsenin neredeyse her yerde harcayabileceğin hediye kartları almanı\nsağlar.\nCyphermarket giysi ve sticker satın\nalarak açık kaynak kodlu yazılım projelerini destekleyebileceğin bir\ndükkandır.\nReflectacles infrared ışığı\nengelleyen gözlükler satar.  Teknolojilerini bir\noku, bayağı ilginc.\nAnon Shop senin Amazon’dan ürün siparişi\nvermeni sağlar, ve ürünlerini anonim olarak kilitli bir dolaba yollar.\nMonero Market Monero-tabanlı bir eBay\ngibidir, satıcılar Monero karşılığında ürün ve hizmet satarlar.\nBunların hepsi birkaç örnek, daha fazlasını bir yerde toplayan\nkaynaklar mevcut, Monerica gibi.\nUnutma, Monero kullanarak doğrudan ödeme yapmak mükemmel olsa da,\nneredeyse herhangi bir diğer kripto para kabul eden dükkanlarda da\nhızlı dönüştürücü hizmetlerini kullanarak\nMonero ile ödeme yapabilirsin.  Eğer minimalist takılıyorsan ve yeni\nşeyler almak istemiyorsan başkalarına Monero ile bahşiş\nverebilirsin."},"1-kullanicilar-icin-kilavuz/tip_monero":{"title":"1.15 Bahşiş al","links":["1-kullanicilar-icin-kilavuz/use_monero","1-kullanicilar-icin-kilavuz/get_a_monero_wallet","1-kullanicilar-icin-kilavuz/gift_monero"],"tags":[],"content":"Monerolarınla yapabileceğin başka süper\nşeylerden birisi hoşuna giden içerik yaratıcılarına bahşiş\nyollamaktır.  Veya, eğer kendin çoktan video, makale, yayın, veya\nçevrimiçi radyo içeriği üretiyorsan, Monero adresini içeriğini tüketen\nkitlelere sunabilirsin ve böylelikle o kişiler sana anonim bahşişler\ngönderebilirler.\nBunun için ihtiyacin olan tek şey adresini bir yazı içerisinde veya\nkarekod olarak, veya her iki şekilde de, paylaşmak.  Adresini\nkullandığın Monero cüzdanı içerisinden\nalabilirsin.  Videona ait tanım kısmına, yayın (ing.: podcast)\nnotlarına, yazdığın makalelerin sonuna, ve topluma açık çevrimiçi\nprofillerine bu adresi koy.\nUnutma Monero adresleri senin gizliliğini korur.  Yani, diğer çoğu\nkripto paraların aksine, eğer birisi sana ait adresi görürse, senin ne\nkadar paraya sahip olduğunu, veya ne kadar bahşiş topladığını, veya\nharcadığını göremez.  Buna ek olarak, eğer Monero farkındalığını\nartırmak istiyorsan favori içerik üreticisinden Monero ile bahşiş\ntoplamaya başlamasını iste.\nMonero farkındalığını artırmanın bir diğer yolu onu en yakınlarınla\npaylaşmandır.  Monero çok iyi bir hediye\nolabilir."},"1-kullanicilar-icin-kilavuz/gift_monero":{"title":"1.16 Hediye et","links":["1-kullanicilar-icin-kilavuz/use_monero","1-kullanicilar-icin-kilavuz/get_a_monero_wallet","1-kullanicilar-icin-kilavuz/the_seed","1-kullanicilar-icin-kilavuz/donate_monero"],"tags":[],"content":"Monero pek çok şey olabilir.  Olabildiği\nşeylerden birisi: özel günlerde hediye almayı unuttuğunda bir son\ndakika seçeneği.  Saka bir yanına, eğer verdiğin kişi bundan\nhoşlanacaksa, veya ilginç bir konuşma başlatmak istiyorsan, bunu bir\ndene.\nBüyük olasılıkla, monero elde edecek olan bu şanslı kişi daha bir\ncüzdan sahibi değil.  Bu nedenle onun için bir cüzdan senin yaratman\ngerekecek.  Ardından onun içine biraz monero koy, ve o cüzdanı ona\nver.  Böylelikle o kişi verdiğin cüzdanla dilediği şeyi yapabilir.\nBurada yaptığın şey bir kâğıt cüzdan yaratmak olarak isimlendirilir.\nBu kripto yolculuğunda karşılaşabileceğin en bariz\nisimlendirmelerdendir.\n\nMonero cüzdan uygulamanı kullanarak\nyeni bir cüzdan yarat, ve ardından tohum kelimelerini güzel bir\nkâğıda, örneğin bir teşekkür kartı, yaz.\nBurası\nveya\nburası\nsana ilham verebilir.  Temel olarak yaptığın şey üzerinde 25 (veya\n16) kelime bulunan bir kart hazırlamak.\nVerdiğin kişiye bu tohum kelimelerini nasıl kendi cüzdanına\naktarabileceğini göster.  Bunun için onlara bu sitenin bağlantısını\nver, veya kısa bir rehber\nmakalesinin\nçıktısını al.\nMonero verdiğin kişinin cüzdanına ait tohum kelimelerini sen\nürettiğin için, bu cüzdana senin tamamen\nerişimin var.  Hediyeyi verdiğin kişiye kendi cüzdanını yaratmasını\nve monerolarını kendi tohum kelimelerine ait bir cüzdana\naktarmasını söyle (aksi takdirde hediye ettiğin monerolara senin\nerişiminin olduğunu vurgula).\n\nEğer aile ve arkadaşlarının dışındaki kişilere de vermeye yatkın bir\nruh halindeysen, her zaman biraz monero\nbağışlayıp karma puanları toplayabilirsin."},"1-kullanicilar-icin-kilavuz/donate_monero":{"title":"1.17 Bağışla","links":["1-kullanicilar-icin-kilavuz/coffee.av1.webm","1-kullanicilar-icin-kilavuz/use_monero","1-kullanicilar-icin-kilavuz/tip_monero","2-meraklilar-icin-proje-plani/lets_do_it"],"tags":[],"content":"Derler ki hayattaki en iyi şeyler ücretsizdir.  Katılmıyorum, çünkü\nçoğu zaman tatmak istediğim gurme kahvenin\nücretini ödemek zorundayım.  Yine de konu gün batımına, paylaşılan\nöpücüklere, ve yazılım projelerine gelince, bu yargı doğru gözüküyor.\nGökkuşağı bir yana, Monero kullanımı hakkında\nkonuştuğumuz için, neden tam çemberi kapatıp onun geliştirilme süreci\nhakkında da konuşmayalım?\nMonero bedava (ve özgür) çünkü geliştiricileri onu hepimizin erişimine\naçık bir şekilde sunmanın iyi bir karar olduğunu düşündüler.  Çoğu\nuygulamalar ve internet siteleri de özgür ve açık kaynak kodlu olmanın\nayrıcalığını paylaşırlar.  Bu demektir ki asıl geliştirici ölse,\nkaybolsa, veya sadece sıkılıp projeyi bir kenara bıraksa bile, başka\nbirisi kolayca projeye ait dosyaları alıp onu inşa etmeye ve programın\neksik gedik şeylerini kapatmaya devam edebilir.\nMonero topluluğunun bağış topladığı ana\nadres şudur\n888tNkZrPN6JsEgekjMnABU4TBzc2Dt29EPAvkRxbANsAnjyPbb3iQ1YBRk1UXcdRsiKc9dhwMVgN5S9cQUiyoogDavup3H\nÇekirdek ekip geliştiriciler bu bağışlarla aktarılan paranın nereye\ngideceğine karar verirler.  Bunlar altyapı giderleri ve teknik\naraştırma giderlerinin yanı sıra, tamamen fonlamaya erişemeyen proje\nfonlama isteklerini tamamlamayı da içerebilir.\nBu çeşit proje fonlama istekleri Topluluk Fonlama\nSistemi (CCS) internet sitesinde\ngörülebilir.  Sen de çok küçük bir miktar da olsa monero bağışlayıp\nbunun nasıl işlediğini görebilirsin.  Bu okuduğun yazının kendisi\n(Türkçe çevirisi hariç -\neditörün notu) CCS aracılığı ile fonlandı.\nKullandığın Monero uygulamalarının kendileri de bağışlara açık:\ncüzdanlar, internet siteleri, yayınlar, haber siteleri, ve\nrehberler tamamen ücretsiz sunulmakta\nve kullanıcılarının cömert bağışlarına dayanmakta.  Onların internet\nadreslerinde ve yayın notlarında adreslerini bulmaya çalış.  Sen de\nher zaman onlara katılıp, Monero için özel bir içerik üreterek, kendi\nbağışlarını toplayabilirsin.\nMonero kullanarak bunun bir parçası ol.  Ve eğer Monero kullanmak\nonun nasıl çalıştığına ilişkin merakını koruklediyse kesfetmeye devam\net."},"1-kullanicilar-icin-kilavuz/get_started":{"title":"1.1 Haydi başlayalım","links":["1-kullanicilar-icin-kilavuz/receive_monero","1-kullanicilar-icin-kilavuz/be_your_own_bank","1-kullanicilar-icin-kilavuz/send_monero","1-kullanicilar-icin-kilavuz/get_a_monero_wallet"],"tags":[],"content":"İlk adımın bir Monero cüzdanı elde etmek olmalı.  Tıpkı “gerçek\ndünyada” paranı koyup taşımak istiyorsan bir cüzdana ihtiyacın olduğu\ngibi, monerolarını da bir yere koymak için bir cüzdana ihtiyacin var.\nDiyebilirsin ki: eğer fazlaca para saklamak istiyorsam bir cüzdandan\ndaha güvenli bir şeye ihtiyacım yok mu?  Basit bir cüzdan çok da\ngüvenli görünmüyor.  Yanıt: kripto dünyasında bizler her şeye cüzdan\nderiz.  Bunun yanında cüzdanlar farklı çeşitlere ayrılır.  Kimi\ncüzdanlar tıpkı pantolon cebindekiler gibidir, kimileri de bir dağ\niçinde bulunan ve lazer güdümlü silahlarla korunan 3 katlı çelikten\nkasalar gibi.  Bu iki uç arasında kalan pek çok farklı cüzdan\nçeşitleri de vardır.\nEğer Monero ile yeni tanıştıysan, sana önerim, şu 3 şeyi güvenli bir\nşekilde yapabilmeden önce yüksek miktarlarla uğraşmamandır:\n\nAlmak\nSaklamak\nYollamak\n\nMerak etme, bunları başaracaksın.  O zaman geldiğinde, önünde bir\nsınır kalmayacak.\nHaydi bir cüzdan elde edelim"},"1-kullanicilar-icin-kilavuz/get_a_monero_wallet":{"title":"1.2 Bir cüzdan elde et","links":["1-kullanicilar-icin-kilavuz/be_your_own_bank"],"tags":[],"content":"Bir Monero cüzdanı senin paranı saklayan bir uygulamadır.\nBunların arasinda senin cep telefonunda çalışanından tut, masaüstü\nveya dizüstü bilgisayarında çalışanına, ve kimi özel cüzdanlar için\nkendine özel elektronik donanımlarda çalışanlarına kadar geniş bir\nyelpazede çeşit vardır.\nEğer daha yeniysen, yapabileceğin en iyi şey güvenlilik ve kullanım\nkolaylığı arasında bir orta yol bulmak, ve bir mobil uygulama\nkullanmaktır.\nAkıllı telefonlarda çalışan Monero cüzdanlarının bir listesi:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nİsimSistemKoinlerİnternet adresiMonerujoAndroidMonero tekwww.monerujo.io/Monero.comAndroid + iOSMonero tekmonero.com/CakeAndroid + iOSÇeşitli koinlercakewallet.com/StackAndroid + iOSÇeşitli koinlerstackwallet.com/\nHoşuna en çok giden bir tanesini seç.  Kimi cüzdanlar sadece Monero\nsaklar, kimileri ise Bitcoin ve Ethereum gibi diğer koinleri de\nsaklar.  Bu cüzdanların hepsi ücretsiz erişime açık, hepsini indirip\ndenemekten çekinme.  Sorun yaşamayacaksın.  Birisini indir ve okumaya\ndevam et.\n\nMyMonero’nun listede görünmemesinin sebebi, o\ncüzdanın listedeki cüzdanlardan biraz daha farklı çalışmasıdır.\nHızlıca açıklamak gerekirse, o cüzdan blokzinciri senin yerine tarar.\nBunu yapabilir çünkü sen o cüzdana sana ait olan moneroları\ngörebilmesini sağlayan, ancak yine de senden çalabilmesine izin\nvermeyen, özel anahtarları verirsin.  Sonuç olarak diğerleri gibi\ngüvenli, fakat diğerlerine kıyasla daha az gizlilik sağlayan bir\ncüzandır.  Kullanım kolaylığı için biraz gizlilikten ödün veriyorsun,\nki bunu seçebilirsin, fakat kullanmadan önce bu çeşit bir takastan ve\nbunun artıları/eksilerinden haberin olmalı."},"1-kullanicilar-icin-kilavuz/be_your_own_bank":{"title":"1.3 Kendinin bankası olmak","links":["1-kullanicilar-icin-kilavuz/get_a_monero_wallet","1-kullanicilar-icin-kilavuz/the_seed"],"tags":[],"content":"Bunu daha önce duymuş muydun? Eğlenceli kısıma geçmeden önce öğrenmen\ngereken önemli bir şey var:\nMonero alıp yollamanı sağlamasına ek olarak monerolarına gerçekten\nsahip olan tek kişinin sen olmasını sağlayan bir\ncüzdana ihtiyacın var.\nEğer bu kulağa garip geldiyse, elindeki altınlarını güvenle yastık\naltında tutmak ve onları banka kasasına emanet etmek arasındaki farkı\ndüşün.  Banka uzaktan güvenli bir yer gibi gözükebilir ancak işin\ngerçeği şu ki sen onlara altınlarını saklamaları için güveniyorsun.\nElinde olan tek şey istediğin zaman altınlarını geri alabileceğine\nilişkin bir inanç.  Altınların bankadayken elinde olan tek şey\nbankanın sözü.\nGüvenli ve denetime tabi bir kripto bankası diye bir şey yoktur.\nHükümetine güvenesen bile onlar hiçbir zaman batan bir kripto\nşirketini kurtarmamışlardır.  Bu şirketlerin çoğu onlara emanet\nettiğin monerolarını kasalarında tutmalarını zorunlu kılan yetki\nalanları dışındadırlar.  Bu kripto bankaları oldukca kolay bir şekilde\nyalan söyleyebilirler ve kasalarında onlara teslim ettiğin moneroları\ntutmayabilirler.\nSana sunduğum listedeki cüzdanlar monerolarının anahtarlarını sana\nteslim edenlerden.  Bu cüzdanlar ayrıca bu anahtarların kopyalarını\nkendi geliştiricilerine göndermezler, yani senin paranı\nçalamazlar.  Bu, bir diğer yandan, eğer monero anahtarlarını\nkaybedersen monerolarını da kaybedeceğin anlamına gelir.  Burada\n“şifremi sıfırla” mekanizması yoktur.  Bu ilk başta ürkütücü\ngelebilir, fakat sana güç ve özgürlük veren şey ayni zamanda budur.\nSenin adına paranı tutanlara güvenmeyi en aza indir.  Şansına, bunu\nyapmak o kadar da zor değil."},"1-kullanicilar-icin-kilavuz/the_seed":{"title":"1.4 Kudretli tohum","links":["1-kullanicilar-icin-kilavuz/be_your_own_bank","1-kullanicilar-icin-kilavuz/get_a_monero_wallet","1-kullanicilar-icin-kilavuz/seed_storage"],"tags":[],"content":"Kendi kendinin bankası olacaksan, kendi\nmonerolarını başkalarının ellerinden koruma sorumluluğu tamamen sana\nait.  Unutma: büyük güç büyük sorumluluk getirir.\nİndirdiğin uygulamayı aç, ve yeni bir\ncüzdan yarat.  Büyük ihtimalle birkaç seçenek önüne çıkacak, fakat en\nönemli olan şey sana tohum kelimelerinin gösterilecek olması.  Bu\nkelimelere aynı zamanda anımsatıcı (mnemonik) kelimeler de denebilir.\nTohumların.  Bunlar senin çok dikkatlice bir yere yazıp saklaman\ngereken rastgele kelimelerdir.  Bu kelimeler senin cüzdanına özgüdür.\nHiçbir diğer cüzdan aynı kelimelere sahip değildir, ve bu kelimelerdeki\nrastgelelik o kadar yüksektir ki başkalarının bu kelimeleri tahmin\nedebilmeleri dünyadaki bütün sahillerde bulunan kumlardan rastgele bir\ntane seçmeye benzer.  Aynı kum tanesini seçemeyeceklerdir.\nTohumunu gerçek bir tohummuş gibi hayal et.  Cüzdan uygulaması onu\nekecek ve oradan bir monero cüzdanı filizlenecek.  Tıpkı dallar ve\nyapraklar gibi, hesaplar ve adresler o tekil tohum kelimelerinden\nbüyüyecekler.  Tohumunu cüzdanının DNA’sı gibi düşün; tıpkı tek çeşit\nbir DNA’nın aynı tipteki bir insanı sürekli yaratabilmesi gibi, aynı\ntohum her zaman aynı cüzdanı yaratacaktır.  Bu yüzden tohumunu\ngüvenli ve gizli tutman çok önemlidir.  Eğer tohumunu kaybedersen\nveya bir hata yaparsan, monerolarını da kaybedersin.  Eğer birisi\nsenin tohum kelimelerini görürse, senin monerolarını da çalabilir.\nBu senin paran, senin sırrın, senin tohumun.  Bir yere yaz, ve\niki kere kontrol et."},"1-kullanicilar-icin-kilavuz/seed_storage":{"title":"1.5 Güvende tut","links":["1-kullanicilar-icin-kilavuz/the_seed","1-kullanicilar-icin-kilavuz/getting_monero"],"tags":[],"content":"Tohum kelimelerini bir yere yazdıktan sonra,\nşunları bir düşün:\n\nAcaba kağıt yeterince sağlam mı, yoksa kolayca yırtılacak mı?  Eğer\ntohumunun bir kısmını kaybedersen paranı tekrar elde edemeyebilirsin.\nKullandığın mürekkep veya kalemin izi gelecekte lekelenip\nsilinebilir mi?  Eğer kelimeleri okuyamaz duruma gelirsen başın yine\nbelada.\nNerede saklayacaksın?  Senin tohumlarına sahip birisi aynı zamanda\nparan üzerinde senin yetkilerine de sahip olur.  Parana istedikleri\ngibi davranabilir ve senin onu durdurma olanağın olmaz.\nYazı çok mu açık?  Eğer birisi yazıdakinin kripto para tohumları olduğunu\nanlarsa, senin zengin olduğunu düşünüp, seni tehdit edebilir.  Bu riski\nalmazsan daha iyi olur.\nEğer senin başına bir kaza gelirse, sevdiklerin (eğer sen de\nistiyorsan) buna nasıl erişebilir?  İnsanlar ölür.  Tipki kimsenin\nsenin tohum kelimelerini tahmin edemeyeceği gibi, kimse senin parana,\neğer sen etrafta değilsen, erişemez.\n\nEğer Monero kullanmaya daha yeni başladıysan, bunlar yanıt vermesi zor\nsorular olabilir.  Endişelenme, çok büyük miktarlarda paralardan söz\netmedikçe, bir kağıt parçası ve tukenmez kalem senin işini görecektir.\nBu kağıt parçasını fiziksel cüzdanının ceplerinden birine koyabilirsin\n(cüzdanı açıp kaparken düşmeyeceğinden emin ol!).  Bunu tipki küçük\nbir miktar nakit para gibi düşün, ona göre sakla, böylece sorun\nyaşamayacaksın.\nHaydi şimdi içine biraz monero koyalım."},"1-kullanicilar-icin-kilavuz/getting_monero":{"title":"1.6 Monero elde et","links":["1-kullanicilar-icin-kilavuz/get_a_monero_wallet","1-kullanicilar-icin-kilavuz/buy_monero","1-kullanicilar-icin-kilavuz/exchange_monero","1-kullanicilar-icin-kilavuz/earn_monero","1-kullanicilar-icin-kilavuz/mine_monero","1-kullanicilar-icin-kilavuz/receive_monero"],"tags":[],"content":"Uygulamanı başlat ve cüzdanını aç.  Şu\nanda boş ve hüzünlü görünüyor.  Büyük olasılıkla içine biraz monero\nkoymak istiyorsun, sonuçta buraya kadar gelmenin sebebi bu.  İşte\nseçeneklerin:\n\nSatın alabilirsin\nBorsada dönüştürebilirsin\nKazanabilirsin\nÜretebilirsin\n\nBunlardan birini seç ve keşfet, veya doğrudan alma kısmına\ngeç."},"1-kullanicilar-icin-kilavuz/buy_monero":{"title":"1.7 Monero satın al","links":["1-kullanicilar-icin-kilavuz/getting_monero","1-kullanicilar-icin-kilavuz/receive_monero"],"tags":[],"content":"Monero satın alabileceğin birkaç yer var.  Temelde moneroyu bir\nşirketten veya başka bir bireyden satın alabilirsin (bu sonuncusuna\nbireyden-bireye, veya p2p de denir).\nÖnemli not: satın aldığın moneroları cüzdanına aldığında senden başka\nkimse onlara sahip olduğunu bilmeyecek.  Tıpkı ATM’den nakit para\nçekmek gibi.  Büyük ihtimalle para çekerken bir kamera seni\nkaydedecek, ve bankanın kayıtlarında aldığın miktar saklanacak, fakat\nbundan sonra o nakitle ne yaptığın sadece seni ilgilendirir.\nBu nedenle çoğu yasal şirketler senin 18 yaş üzerinde olmanı ve kendi\nkimliğine ait yasal dokümanları teslim etmeni isteyecektir.  Bu ideal\nbir durum kesinlikle değil, çünkü ortada Monero satın aldığına ilişkin\nkayıtlar olacak.  Bu bugün büyük bir sorun gibi görünmeyebilir, ancak\ngelecekte sorun haline gelebilir, kim bilir?\nEğer bir şirketten Monero satın almak istiyorsan ve bunu yaparken\nkimliğini açığa çıkarmak seni rahatsız etmiyorsa:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBorsaKurulum tarihiKurulum yeriKraken2011Amerika Birleşik DevletleriKuCoin2017Seyşeller\nEğer başka bir bireyden doğrudan satın almak, ve bunu yaparken\nkimliğini açığa çıkarmaktan kaçınmak istiyorsan:\n\n\n\n\n\n\n\n\n\n\n\n\n\nKYCnot.meBu site doğrudan bir satıcı değil, ancak sana doğrudan ve kimlik sormadan Monero satan hizmetlerin bir listesini tutuyor.  Detaylar için ona göz at.Topluluk kanallarıTelegram, Discord, Matrix, Signal, vb. kanallarda yerel satıcılar bulabilirsin.  Elbette ilanlara dikkat ve şüpheyle yaklaş, çünkü dolandırıldığın takdirde tüketici koruma kurumları bulunmayacak.\nFark ettigin gibi, Monero satın almanın mükemmel bir yolu yok (hiçbir\nşey mükemmel değildir).  Unutma Monero elde etmenin farklı yolları\nvar.\nEğer satın almaya karar verdiysen, aldığın şirket veya kişi,\nmonerolarını sana gönderebilmesi için, senden bir Monero adresi\nisteyecek.  Bunu doğru bir şekilde nasıl yapabileceğine\nbakalım."},"1-kullanicilar-icin-kilavuz/exchange_monero":{"title":"1.8 Başka bir kriptoyu Monero'ya dönüştür","links":["1-kullanicilar-icin-kilavuz/receive_monero"],"tags":[],"content":"Eğer elinde başka bir kripto para varsa, onu Monero’ya dönüştürmek\noldukça kolay.  Elinde iki seçenek var:\nBüyük ve belki de denetime tabi bir şirketin borsasında kripto dönüştür\nOlumsuz tarafı: orası büyük ihtimalle senden KYC isteyecek.  KYC,\nİngilizce’de Müşterini Tanı anlamına gelen söz öbeğinin\nkısaltmasıdır.  Bu çeşit şirketler senden pasaport veya kimlik kopyanı\nisteyip kimlik doğrulama işlemleri uygulayacaklardır.  Bu durumda\nonlara kim olduğunu, ne kadar kripto sahibi olduğunu, ne kadarını\ndönüştürdüğünü, ve hangi adrese çekim yapmak istediğini söylemek\nzorunda kalacaksın.  Olumlu tarafı: bu işlemlerin ardından Monero’ya\neriştiğin takdirde, Monero senin arkanı kollayacak ve kendi cüzdanına\nait gelecekteki işlemlerin gözetimden korunmasını sağlayacak.  Fakat\nyine de bu durumda Monero satın aldığına ilişkin reddedilebilirlik\nseçeneğinden ödün vereceksin.  Şirket seçeneklerin:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBorsaKurulum tarihiKurulum yerikraken.com2011Amerika Birleşik Devletleribitfinex.com2012Britanya Virjin Adalarıkucoin.com2017Seyşellertradeogre.com2018Kim bilir?\nBunların hepsi aynı şekilde çalışır.  Belli miktarda bir koini borsaya\ngönderirsin, ardından içinde XMR bulunan bir dönüştürme çifti\nbulursun, örneğin BTC/XMR veya LTC/XMR.  Ardından ya doğrudan XMR’a\ndönüştürme işlemi başlatırsın, veya öncelikle XMR ile dönüştürme çifti\nbulunan bir kriptoya geçersin, BTC veya USDT gibi, ve ardından o koini\nXMR’a dönüştürürsün.\nBir kere bunu yaptıktan ve bakiyende XMR bulunduktan sonra, çekim\nyapmalısın.  Borsa sana monerolarını yollamak için bir cüzdan\nsoracak.  İşlem tamam.\nSenden hiçbir kimlik bilgisi istemeyen daha küçük bir işletmenin dönüşüm hizmetini kullan\nBu işletmelerin kimileri anonim kişiler tarafından yürütüldüğü için\nbiraz daha riskli, bir şeyler ters gittiğinde sorumlu tutabileceğin\nbir kişiyi bulamayabilirsin.  Fakat küçük para miktarları için bu\nişletmeler neredeyse mükemmel bir çözüm sağlar.\nBunlardan pek çok sayıda bulunur ve bunlar sürekli hizmete açılıp\nkapanırlar.  Burada en iyi seçeneğin bu çeşit hizmetleri sıralayıp ne\nkadar gizliliğini koruduklarına veya sorunları ne kadar hızlı\nçözdüklerine göre sıralayan internet adreslerini ziyaret etmektir.\nkycnot.me, Trocador, ve\norangefren bu çeşit sitelerdir.  Unutma,\nbunlar koinleri kendileri dönüştürmez, dönüşüm işlemleri\neXch, Exolix,\nChangeNOW, Majestic\nBank, ve diğer hizmetler tarafından\ngerçekleştirilir.  Bunlardan bazıları uzun süredir hizmette, bazıları\neninde sonunda Monero’yu terk etmek zorunda kalacak; uzun lafın\nkısası, bunlari deneyip kendin için işe yarayanlarını görmek sana\nkalmış."},"1-kullanicilar-icin-kilavuz/earn_monero":{"title":"1.09 Monero kazan","links":["1-kullanicilar-icin-kilavuz/buy_monero","1-kullanicilar-icin-kilavuz/getting_monero","1-kullanicilar-icin-kilavuz/mine_monero","1-kullanicilar-icin-kilavuz/tip_monero","1-kullanicilar-icin-kilavuz/receive_monero"],"tags":[],"content":"Unutma ki satın almak zorunda kalmadan da her\nzaman Monero elde edebilirsin.  Sana birkaç\nfikir:\n\nBilgisayarını kullanarak monero üret.\nYoutube ve diğer platformlarda yayın ve video içeriği üreterek, veya\ninternette makaleler yazarak bahşiş topla.\nİnsanların katkıda bulunmak isteyecekleri bir toplu fonlama\nbaşlat.\nAçık ödülleri tamamla.\nHizmet sun ve Monero ile ödeme al.\nÜrün sat ve Monero ile ödeme al.\n\nBu yöntemlerin hepsini denemekten çekinme.  Bunun yanı sıra, nasıl\nMonero alabileceğini de bilmen gerek."},"1-kullanicilar-icin-kilavuz/index":{"title":"1 kullanıcılar için kılavuz","links":[],"tags":[],"content":""},"2-meraklilar-icin-proje-plani/money_ledger":{"title":"2.10 Tüm defterlerin anası","links":["2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/blockchain"],"tags":[],"content":"Yeni koinleri öngörebildiğimiz ve uzlaştığımız bir ritimde\nyaratabildiğimiz bir yöntem icat ettiğimize göre\nyaratılan bütün koinleri içinde tutan bir listeye ihtiyacımız var.\nNeden?  Çünkü burada her şey sanal olduğu için, var olmak demek\nsadece bir yerde kayıtlı olmak demek.  Diskinde kayıtlı olarak var\nolan bir jpeg ile mantar panoda raptiye ile asılı durarak var olan\npolaroid arasındaki fark bu şekildedir.\nBu zor değil, her madencinin ürettiği koinleri yazmalarını ve ardından\nda, örneğin yemek için, harcadıkları koinleri silmelerini koşul\nkoyabiliriz.  Fakat bu durumda, diğer herkes başkalarının kendi\nhanelerinde yazan koinleri havadan uydurmadığını nasıl bilebilir?\nBundan da önce, var olan koinler harcandıkları zaman bunu nereye\nyazacağız?  Göndericinin koin listesine mi?  Alıcının?  İkisi de?\nEğer çok sayıda oyuncu ve çok sayıda koinimiz varsa bu nasıl\nçalışacak?  Durum oldukça hızlı bir şekilde karmaşıklaşabilir.\nBurada çözüm sadece tek bir liste tutmak.  Bu liste, ilk sayımından\nitibaren yaratılan bütün koinlerin miktarını kaydedecek.  Listede\nşunun gibi maddeler yer almalı: “Madenci X kazandı ve bu sebeple 6\nkoinle ödüllendirildi.”  Ardından da şunun gibi pek çok sayıda madde:\n“Madenci X 4 koini oyuncu Y’ye verdi”, “Oyuncu Y 3 koini oyuncu Z’ye\nverdi” ve bunun gibi nice.\nListede (jargondaki adı defter) kimsenin yalan söylememesini\nsağlamak için ise herkesin aynı listenin bir kopyasına sahip olmasını\nsağlayabiliriz.  Birisinin listede bir değişiklik yaptığı her sefer,\nbu değişikliği de herkesin kendi listesine kopyalarız.  Böylelikle\nsistemde hangi miktarda koin olduğunun takibini tutmuş olur, kimsenin\nde koin gönderirken havadan yeni yaratmadığını kanıtlarız.  Basitçe,\ngünün sonunda denklemin her iki tarafı da eşitlenmekte olur.\nBu tekil, paylaşımlı ve herkese açık listeye, ünlü adıyla,\nblok zincir denir."},"2-meraklilar-icin-proje-plani/blockchain":{"title":"2.11 Enter the blockchain","links":["2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/hashes"],"tags":[],"content":"The blockchain is the long list containing every coin created and every coin sent. Put it differently, how much there is and who owns what. The name blockchain is quite literal, we’re making our list in the shape of a chain of blocks. Let’s see why it’s a great idea. More than that, it’s one of the biggest ideas of recent times.\nImagine a post-it note. This note is a small yellow square paper where we want to write the transactions made in our game. We decide that the papers should be big enough so that a reasonable number of transactions fit it, but not too big, so we don’t want a lot of space wasted if there are not enough numbers to write on it. This has an interesting side effect, instead of using a single big sheet of paper where we all write more information and therefore take longer, we use a several small ones. The way, if we have a disagreement with something written on one of them, we don’t have to write the whole huge list again, we just make that post-it into a ball, throw it in the bin, and try with a new one. But the previous ones we already agreed upon are good and set.\nHow can we ensure an order, that one paper came after the other? In other words: how can we always tell which one is the most recent paper? How can we be sure that nobody cheated changing the content of an old post-it, and just shuffled it back into the pile?\nOur post-its are the blocks of our blockchain. And to secure it we have math on our side. We can use something called hashes."},"2-meraklilar-icin-proje-plani/hashes":{"title":"2.12 Hashing","links":["2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/nonces"],"tags":[],"content":"If we want to chain several pieces of information in a way that would make any attempt to modify any of the in-betweens impossible (or at least very noticeable), there’s a neat math trick we can use called hashing.\nHashing is a mathemagical way to produce a number (or a string of characters) that is derived from another data, and could only come from that piece of data. We can use that for our line of post-it notes with transactions.\nFor example, a very simplified version of hashing would be to use the formula “+2”. If we have the number 1, and we apply the hashing +2, we get 3. In this case, 3 would be the hash of 1. It sound simple (hopefully) but then anyone that knows the three pieces of information (the input, the hashing formula, and the result), can verify that 1 is the real number we hashed, and not 5 for example. The hash of 5 using our +2 formula would be 7, not 3.\nWe are going to use hashing in a way or another a lot while creating our cryptocurrency, because they’re very useful. And the first way we’re going to use them is to link our blocks together."},"2-meraklilar-icin-proje-plani/nonces":{"title":"2.13 Sensical nonces","links":["2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/hashes","2-meraklilar-icin-proje-plani/consensus"],"tags":[],"content":"Our shared list of notes with the new coins written in needs two basic properties: they should be in order, and once we write on them, they shouldn’t be possible to rewrite. Why? Well, the order part is important, since a user cannot give money they hadn’t received first. Very logical. So our papers have to be in order. And if users could rewrite old papers, they could just send money to pay for something, get it, and then go back and rewrite that transaction and for example give that money to themselves. Such a feature won’t get our money too adopted.\nIt’s like you having a time machine to give yourself information about the future so you can bet and make money. If you’re the only one who can do it, you’d be rich, but if everybody could do it, nobody would bet.\nIn order to link our notes in order, we can add the results of hashing to the end of each post-it, and then copy it at the beginning of the following note. See the pattern? The first block has a number at the end, and then another block has that number at the beginning, if we see such block, we know it’s the second! And so with the third, forth, etc.\nAnd the thing we could hash, instead of a random number, could be the sum of all the written transactions in that post-it or block, so if we change just a single digit or one of the transactions on it, the hash would change. So a paper has let’s say 10 transactions written on it. We add them all up, then hash them out. We write the hash at the end of the paper. Then we add another paper, and the first thing we write is the lash hash from the previous paper. Then we write all the new transactions that fit on the paper, add them all up including that hash at the beginning, and we hash that. We have a new hashing result, we write it at the end of our paper, and grab a new one.\nIf someone wants to grab any of the older post-its, and change anything, all the following hashes would be different. And if we all have a copy of that chain of post-its, we’ll notice that, and call that modified paper fake. Problem solved.\nBut not so fast. How can we ensure that we all have the same list and not just a bunch of confusing different copies? To put it fancy: How can we reach consensus about which one is the one true list?"},"2-meraklilar-icin-proje-plani/wallets":{"title":"2.14 A wallet is not a wallet","links":["2-meraklilar-icin-proje-plani/miners","1-the-manual-for-users/1.02-get_a_wallet","1-the-manual-for-users/receive_monero","1-the-manual-for-users/send_monero","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/keys"],"tags":[],"content":"Now that we have invented a way to bring new coins into the system in a steady and predictable way, and a way to write where they move in a shared list we cannot endlessly edit, we need to come up with those places where those coins will go to. Where will the users store their coins? How do those coins get there? How do they send them afterwards to others if they want to?\nWe need to create wallets.\nWe call them wallets because for the most part we can carry them with us (unless you’re like my brother who has a wallet that is so filled with junk that is as thick as it’s wide). But we could call them safes, or purses, or any other analogy to the physical money world.\nBut since our money is digital, we cannot really “put stuff inside a container” for real. To solve that problem, we need to change the analogy.\nA crypto wallet is not really a wallet. It’s usual and easy to call them that because from the outside looks like we put our money in and out of them, but crypto wallets work more like a keychain. That’s because in reality moneros are not sent anywhere, they’re written into existence on the famous blockchain, and with your keys, you prove that you’re the owner and can do what you want with them.\nSo instead of having a box where players of the Monero game store their coins, we’ll have one big list of all the coins in the game, and the only thing we need to give users are keys that they use to prove they own their coins.\nIt’s like one big giant bank we run between all the players, and we’ll give everybody an infinite amount of safety boxes, each with their own matching keys to open them."},"2-meraklilar-icin-proje-plani/keys":{"title":"2.15 Let there be keys","links":["2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/random","2-meraklilar-icin-proje-plani/from_keys_to_seeds","2-meraklilar-icin-proje-plani/key_selection"],"tags":[],"content":"If we’re doing the almost-infinite amounts of wallets for the players of the game, we’ll need an equally big set of keys for those wallets.\nWell, since this is all digital, we can decide that a key will be a very specific and long random-looking sequence of letters and numbers. So long and random that if you try to guess a specific key that holds a lot of moneros, it would be the same as picking the right grain of sand from all beaches in the world combined. That would require a lot of luck. So if we give a monero user a key, nobody else could just guess his key and use his moneros as their own.\nMath to the rescue! Using math, we can use a set that contains 115,792,089,237,316,195,423,570,985,008,687,907,853,269,984,665,640,564,039,457,584,007,913,129,639,936 choices for keys. Actually, forget the grains of sands, it’s calculated that the number of atoms in the observable universe is something like this: 102,468,180,827,345,678,901. So look at our pool of possible keys with awe and pride.\nEvery key is like that wallet’s DNA. Like a seed that grows a tree with many branches on it. Branches with endless accounts and addresses. Following that idea, we’d only need to save that seed and every time we plant it, the same tree with the same branches would grow. It’s like writing down the DNA of identical twins.\nEvery user now just has to store those keys safely, and be able to get one of those grains at will."},"2-meraklilar-icin-proje-plani/key_selection":{"title":"2.16 You get a key","links":["2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/random","1-the-manual-for-users/seed_storage"],"tags":[],"content":"Ok now we know how our keys look like. But in order for everyone to have their own keys to prove to the network that they own some specific moneros, we need some way of assigning those keys first. But for obvious reasons, those keys must be secret to anyone else besides the owner. What could we do to create and give keys to players of the Monero game without knowing them? What’s more, how could we do it without a single key master that controls the making of keys? Because otherwise we’d have a key god that could access any monero at will.\nThe solution is to have a super huge box full of a gazillion keys and make every player pick a key for themselves without telling anyone. That way, it’s their secret. But people are very bad at randomness. If I tell you to pick a random number between 1 and 10, depending of your personal background, there’s a 45% chance that you’ll pick 7. We’re also very bad at faking randomness. That’s how some financial crimes are solved, by the way. Analysts find human-made patterns in spreadsheets that should have a lot of organic noise.\nSo when a user creates a Monero wallet using any Monero app, what that app will do is get a random number from the device, run it through some code three times for better obscurity, and come up with a individual pick from our mega huge set of possible keys. Then show it to the user, and beg for the user to write it down somewhere safe, just in case. Because life happens, phones fall in toilets, computers get stolen, etc."},"2-meraklilar-icin-proje-plani/random":{"title":"2.17 How random is random","links":["2-meraklilar-icin-proje-plani/key_selection","2-meraklilar-icin-proje-plani/addresses"],"tags":[],"content":"So those unique keys every user can get for free are created with a base random number given by that device. That device can be an Android or an iOS phone, or a PC running Windows, or Linux, or a Mac.\nBut the interesting rabbit hole is: how can a computer device come up with truly random numbers, if it’s programmed and therefore (with some luck, looking at you, Windows) ultra predictable?\nWell, there’s no easy response for that.\nSadly, in most cases it’s a bit of a black box. We cannot really tell what’s going on in there. There are specific hardware randomness generators which are expensive and therefore not common, that take some tiny physical phenomena, like the noise-like data from electrons as the seed to start generating numbers from. Basically the universe is filled with physical stuff we don’t know how to predict, and that makes a great start for a random number.\nFor all purposes we’ll assume our pseudo random number generators are good enough, say to ourselves “Everything is fine” and continue with our journey."},"2-meraklilar-icin-proje-plani/public_key":{"title":"2.18 A tale of two keys","links":["2-meraklilar-icin-proje-plani/key_selection","2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/addresses"],"tags":[],"content":"So now we have a very unique and special key that we can use to prove to everybody else that some of the moneros on the shared list are ours. But think about it for a second, or five seconds. If we give someone the key to your house just to prove that the house is ours, that person can also enter the house. How can we solve this?\nAnother way of thinking about this problem beyond our money creation dilemma, is to think of it as secret sharing. We want to privately disclose to the network our special key without making it public, not only to anyone eavesdropping, but also to the network itself! It’s our key after all, and no one else’s.\nSo, if two people want to say a secret to each other, they can come up with a very clever and secure key to encrypt the message. But how can they send each other such key without it being intercepted, or uncovered? You could make a giant nesting doll of encrypted information, but you’ll eventually always reach a problem sharing the first key that decrypts all the other ones.\nBelieve it or not, it took up to 1976 for a solution to this problem to be public. And it changed almost everything. The solution was to have two set of related keys, one is private (for your eyes only) and one is public (for everybody else).\nHow does it work? Well, the public key is created used the private key, with a formula that is one-way only. You cannot guess the private key if you know the public key. But the key part here (pun intended) is that you can use your private key to unlock or decrypt anything that was encrypted with the matching public key.\nHere’s how we can use this for our money: we can have a key that grants us rights to our money, and create public addresses with it, so that anyone can use those to send money to us. That way, no one can guess our private key just by knowing our public ones."},"2-meraklilar-icin-proje-plani/from_keys_to_seeds":{"title":"2.19 From keys to seeds","links":["2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/mnemonic_seeds"],"tags":[],"content":"Since the keys are what users of our money will use to prove which money is theirs, and do stuff like sending it somewhere, they’re obviously very important to save well and keep them a secret from everybody else.\nThe logical next step once you get your keys, would be to write them down. But take a look at this key:\n378bc5e22fc9fc02b41af8dd943e794f70576634b6223f3eba7ea76efe2c4400\nNow take a look at this one and see if you can spot the problem:\n378bc5e22fc9fc02b4laf8dd943e794f70576634b6223f3eba7ea76efe2c4400\nDo you see it? There’s only one character changed. A 1 for a lower case l. This may look trivial, but with that single change, they’re totally different keys, they’d unlock very different wallets, and there’s no way to know which one is the wrong character, if any, or how many. No way.\nSo we have a problem. It’s very hard to write down these keys we created without making mistakes. And a tiny mistake as bad as a big mistake. It’s perfect or nothing. And if the keys are very difficult to write without errors, people are going to do insecure things to save them, like taking photos of the keys (which could be easily found on a device, have no encryption, could be automatically uploaded or shared without noticing it) or copy and pasting the keys on a text file somewhere. Even worse. We need to do something.\nThe solution is to translate from computer to human, from a meaningless string of characters, to a list of words. We’re better with words. We know that “food” is correct, and “fuod” is not. For example, our original key encoded into words would be:\nnouns older lids rodent pumpkins railway wiggle mailed hoax waking evenings nocturnal oozed buckets germs gearbox gauze neon update axis macro syndrome madness magically rodent\nHow is this possible? Because we have a smaller number of characters than we have of words. But the important thing is that now users can write down a reasonably short list of words, all of them very different from each other, and with that have a perfect manual copy of their key. It’s easier to count the words to see if you’re missing one, and if you write down a mistake, it’s pretty easy to spot it."},"2-meraklilar-icin-proje-plani/lets_do_it":{"title":"2.1 Haydi başlayalım","links":["2-meraklilar-icin-proje-plani/money_is_a_battery"],"tags":[],"content":"Konfüçyüs’ün de dediği gibi:\n\n“Duyarsam unuturum.  Görürsem hatırlarım.  Yaparsam anlarım.”\n\nBurada okumakla sınırlı olsak da, yapmaya olabildiğince yaklaşmaya\nçalışalım.  Bunun için, varsayalım ki birlikte sıfırdan Monero’yu inşa\nediyoruz.  Böylelikle onun nasıl çalıştığını keşfetmenin yanında\nbirinin onun neden bu şekilde çalışmasına karar verdiğini de\nanlayabiliriz.\nİdealde, bunu yaparken, Monero’nun yapısı sana da mantıklı gelecek.\nDaha da iyisi, eğer bir nokta mantıklı gelmezse, onu daha iyi etmek\niçin elinde araçların olacak.  Unutma ki, her ne kadar karmaşık\ngözükse de, Monero bizler gibi sıradan bireyler tarafından parça parça\nbir şekilde kuruldu.  Bu bireyler de tıpkı bizler gibi eksikliklere ve\nhatalara açıklar.\nMonero’yu sıfırdan kurarken benim para hakkındaki\nanlayışımı da göz önünde bulundurmakta\nyarar var.  Böylelikle ilerledikçe benim de sahip olabileceğim ön\nyargılarım gözünün önünde olacak."},"2-meraklilar-icin-proje-plani/mnemonic_seeds":{"title":"2.20 Mnemonic seeds","links":["2-meraklilar-icin-proje-plani/from_keys_to_seeds","2-meraklilar-icin-proje-plani/addresses"],"tags":[],"content":"We had the great idea of translating, or better said encoding our long string of meaningless characters into meaningful words. But how’s that possible?\nLet’s break it down step by step. The original key was something like this:\n0011100000111000110001011110001001110001001001111111110000000000101101000000010101111110001101101101101001001111110000010100111100011001000000010000101101000101111100110101101101101001100001111101110011101000111101001101111111111000101111101111101001111101111010111111000100111101001000001001001000111111111111111000001001000000\nWhy is it pure zeros and ones? Well it’s the language that computers actually understand. Binary. things are either on or off. Ones or zeros. But notice how long that binary key is. It’s 256 numbers long! That’s what happens when you can only use 2 different characters, a 1 or a 0. You have to use a lot of them to write down a moderate piece of information.\nTo make it easier for us humans to check and read those keys, we could make it shorter for a start. To compress that key quite a bit we could use more characters than just 2. We could use 58 for example:\n123456789ABCDEFGHJKLMNPQRSTUVWXYZabcdefghijkmnopqrstuvwxyz\nThat’s called Base58. That’s a set of 58 different characters that are hopefully distinct enough between them to reduce mistakes. For example, depending on the font you’re using, a 1 and a l could be almost identical. So, let’s convert our binary key into Base58:\n378bc5e22fc9fc02b41af8dd943e794f70576634b6223f3eba7ea76efe2c4400\nThis is pretty good, way shorter. It’s a good thing we humans can read and write more characters than computers do. But still not super practical for human handwritten backup copies, or eyeballing differences. They’re still 64 meaningless characters. What if we could compress it even more, so that we only have 25, plus they made sense to us? What if we could use an alphabet we’re very good at using daily, so we can write it down, read back, and spot any mistakes with ease? Good idea. But unless we’re using Chinese, we have no more characters. To solve the compression problem we can use an alphabet of more than 1200 different characters, and to solve the readability problem we can use words instead of single characters.\nWe need to agree on a shared dictionary, a list of the words we can use, and then try to compress our key again:\nnouns older lids rodent pumpkins railway wiggle mailed hoax waking evenings nocturnal oozed buckets germs gearbox gauze neon update axis macro syndrome madness magically rodent\nOh yeah. Now we’re talking. It may look longer at first sight, but now instead of 64 different “items” that could be right or wrong, we just have 25. And errors are pretty easy to spot as well. Even if the writing is pretty bad, we can guess it says evenings and not evonings.\nThat’s the reason we use mnemonic seeds. Mnemonic refers to something being easier to remember. Now we have easier to remember seeds that can be automatically translated into computer keys to prove ownership of our beautiful digital money.\nFrom them we can create addresses for people to receive and send money from and to each other."},"2-meraklilar-icin-proje-plani/addresses":{"title":"2.21 Addressing the problem","links":["2-meraklilar-icin-proje-plani/public_key","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/stealth_addresses"],"tags":[],"content":"Now let’s think it a bit further. We have a private key that we can use to generate a public address, we give other people that address, those people take that address of ours and send us money. How do they do that? By asking the miners to write down on that shared list we call blockchain that they give us money, the senders pay them a tiny fee for the work, and it’s set on digital stone.\nBut if we want to be able to verify that list between all of us users of the money, that list has to be public. And if the list is public, everyone else can see that someone gave some amount of money to somebody else (in this case our address). That is bad on itself, but what happens if we give that address to more than one person? Or if we make it public so anyone can donate money to us?\nWe run into very big problems very fast. Our scheme works as if giving someone our email address, allowed them to read any other email that has been sent to the same address. Oh no.\nBelieve it or not, most cryptocurrencies work like this. It’s only made less worse because you can create a lot of different addresses with the same key, but since all movements are written on the list with the true addresses, you could follow the money from address to address until someone pays something with it, and then trace back all their amounts and interactions. Not good. To avoid that you could remember to never send anything between your own addresses, but it would be like having a different bank account and spending from a different credit card for every person or business you interact with. It’s not practical, to say the least.\nTo solve this, we need stealth addresses."},"2-meraklilar-icin-proje-plani/stealth_addresses":{"title":"2.22 Burner addresses","links":["2-meraklilar-icin-proje-plani/addresses","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/public_key","2-meraklilar-icin-proje-plani/address_reuse"],"tags":[],"content":"Just like burner phones, our money will use “disposable addresses” so we never use the same address twice. That way, nobody can see in the public list of transactions how much money was sent to any address, and therefore cannot calculate how much money is in there.\nBut a problem appears, if we only use the same address once, does that mean we need to remember each time to create a new address to give to anyone we transact to? Even worse, we would need to keep sending that person another new address for every time they want to send to use. Even worse! Since our blockchain is decentralized and permission-less, we have no way to control that our friend really uses a new address of ours every time. he could be lazy, and our entire plan is screwed.\nIt’s also very cumbersome for our normal life not having a persistent address that doesn’t change, so we can put it somewhere. For example in our profile or website, or in an image asking for donations, or in a QR code to pay for an entrance ticket, etc.\nBut there’s a very clever way to address both things (see what I did there). Monero uses something called stealth addresses. Literally the best of both worlds: we use public addresses that don’t need to change every time, but every time that address is written on the list to send any amount to it, our app will automatically replace it with a different address, generated by it.\nThat way, since our addresses are all generated with our secret key, and all stealth addresses are derived from those addresses, only us with our key will know which transactions were meant for us. To everyone else looking at the list, they all look like undistinguishable one-use addresses.\nRemember, that means the user won’t have to use a different address every time, and still be private.  But it doesn’t mean all privacy angles are covered."},"2-meraklilar-icin-proje-plani/address_reuse":{"title":"2.23 The link that remains","links":["2-meraklilar-icin-proje-plani/stealth_addresses","2-meraklilar-icin-proje-plani/addresses","2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/accounts","2-meraklilar-icin-proje-plani/consensus"],"tags":[],"content":"Our super-duper-burner-stealth addresses work like charm, but there’s still one link possible between our transactions, and that is (as in most cases) human behavior. Think of the following scenario. I’m a political dissident on a country ruled by a government that likes to put political dissidents in prison. I dedicate many hours to write on the web, denouncing the evil doings of such tyrannical government. I’m not stupid and I don’t want them to knock on my door in the middle of the afternoon, so of course I do this anonymously, using an alias. To support my work, I have a public address for donations, so those that like my work can contribute. So far so good. We already know that even though that address doesn’t change, every time someone donates, their add will write a different stealth address on the list, and nobody can tell that I even received anything.\nBut during my days, I’m also a merchant. I have a little bar where you can pay with Monero as well. If I use same public address, anyone that have seen that address published on my site, will know I’m the same person. It’s like your name. You’ve just linked both of your personalities by basically using the same public address, just like you would if you used the same name.\nLesson learned: don’t use an address in more than one place or occasion. The internet never forgets, and it’s pretty easy to search for matches. Luckily, we can design our wallets so that we can get multiple addresses from the same seed, and keep our different personas separated.\nOur money cannot protect everyone from everything. But it’s pretty close.\nOne thing though, it’s one thing to protect users from losing their money or their anonymity, but how can we ensure that there’s only one of those moneys in the first place? Only one list and not multiple ones? How can we agree on the list?"},"2-meraklilar-icin-proje-plani/consensus":{"title":"2.24 Consensus","links":["2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/addresses","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/nodes"],"tags":[],"content":"We have our chained blocks where we write the transactions, we have the miners who write on that blockchain and get new coins into the system, and we have the keys and addresses for our players to receive coins.\nI don’t know if you noticed, but we’re missing an important actor here. Who’s gonna be in charge of keeping all the copies of that shared list? Because if a bunch of people with copies agree on cheating, they could write some extra money for them by modifying their copies and claim they’re the “real” list copies. The problem we’re encountering is sometimes referred to as the Bizantine Generals’ Problem.\nTo avoid that we need more people having copies. How many? As many as possible, so many as to render it very very difficult for more than half of them to agree on cheating. Because the players of the game will check the blockchain copies, and if the majority of the copies looks identical, will take that as the true list. That’s why if more than 51% of the copies are identical, everything works even if the other 49% aren’t. We as players will just assume they’re wrong and discard them.\nIn the case of our Monero game, to have as many people with copies as possible, anybody is able to have one for free. It’s public after all. And since our money is digital, that copy of the list is a digital file as well, stored on a computer connected to the internet. We’ll call those computers nodes."},"2-meraklilar-icin-proje-plani/nodes":{"title":"2.25 Nodes","links":["2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/clock"],"tags":[],"content":"We call the computers with a copy of the list of all transactions (the written chain of blocks) a node. Why do we call them such? A node is the name of the points of a net that are connected to each other. Picture a spider web. It’s a bunch of lines connected to each other. The points where those lines touch each others are the nodes of that net. A decentralized computer network is just like that web. Every computer is a node, and connects to one or several other computers. If you see a map of that network, and the network is decentralized enough, it would look like a spiderweb knitted by a spider on drugs.\nSo those computers will basically do two things:\nThey will look around for other computers with list copies. If they see that the rest have longer lists (lists that have more blocks written on them), they’ll assume they’re behind and update their copy. We can assume that if a list is longer than another, and their blocks are properly chained, then the list is newer than the others. Think of it for a minute. We just found a way to know which list is older and which new without using clocks or dates written anywhere. We invented our own clock.\nThe second very important task they do is allow the users to connect to them to check the list. What good is a distributed public list if no one can take a look? So our Monero app will connect to a node to get access to the list of transactions, know if the users received any new coins, and broadcast any transfers of coins that they want to do. After all, a transaction that is never shared, is like the tree that falls down in the forest when nobody is around to listen it."},"2-meraklilar-icin-proje-plani/clock":{"title":"2.26 Our own clock","links":["2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/nonces"],"tags":[],"content":"This detail may sound silly but it’s very important. If we used clocks and timestamps to set our transactions in order, we need to trust someone with the responsibility to keep that clock in time. And that centralized actor could literally turn back time and make transactions never happen in our lists. This sounds like sci-fi, but that’s only because we’re used in our regular life to all of the clocks around us to be more or less in sync.\nLet’s make a thought experiment: if in the middle of the day, all the clocks at your disposal showed that it’s 3 in the afternoon when it’s actually 5. Would you be able to notice it? Would you trust yourself or the clocks? Even if you realize that the hour was changed, how could you prove it to someone else?\nIn the case of the real world and clocks, we have a decentralized set of more than 400 atomic clocks in 80 different institutions that all contribute to an average called the International Atomic Time. It would be difficult for all those institutes to conspire to mess up our clocks worldwide.\nIn the case of a cryptocurrency like Monero, we need a clock that is self-regulating, independent, and cannot be taken backwards. Specially not without us noticing. And even better, if it happens, anybody can prove easily that something is wrong.\nThe clock we’re using are the blocks of our blockchain and new block is the Monero smallest unit of time. Every block is a tick of Monero’s clock. One after another, linked."},"2-meraklilar-icin-proje-plani/bizantine_generals":{"title":"2.27 The Byzantine Generals' Problem","links":["2-meraklilar-icin-proje-plani/consensus","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/blockchain"],"tags":[],"content":"In the land of crypto we hear this a lot. What’s it about? Imagine there’s a siege and three generals from the Byzantine empire are surrounding a big city, ready to attack. If they all attack together, they will surely win. But if only some of them do it, those could lose. So, to achieve the best result, they have to agree on if and when to attack. That’s how this problem relates to our consensus problem. It’s the same.\nTo communicate between them, the generals send messages between them saying things like:\n“I think we should attack tonight”\n“I agree with attacking tonight.”\n“Yeah, let’s do it tonight.”\nIf they all end up agreeing, it’ll look like victory is ensured. The night comes, but only two of them attack, and get crushed. The remaining one was left untouched. He was a traitor and he was lying.\nWhen it comes to our money, the equivalent thing to “attack tonight” would be “this is the true list with the right transactions”. We need to design the system in such a way that it penalizes the traitors and makes it not worth it to cheat. In the case of generals, you could make it so every other general takes each other’s sons to battle with them, so you have an incentive not to get them all killed. In the case of our cryptographic money, we use mining and the usage of electricity to make it not profitable, the spread of lists in nodes to make it impractical, and the chained blocks to make stuff irreversible."},"2-meraklilar-icin-proje-plani/full_wallet":{"title":"2.28 A full wallet","links":["2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/money_ledger","3-the-blueprint-for-makers/light_wallets","2-meraklilar-icin-proje-plani/quick_wallets"],"tags":[],"content":"Maybe you already had the following idea: why don’t we put the keys to our wallets and the node with a copy of the list all in the same app? That way we could just have as many nodes as users of our money exist. Looks like a win-win scenario, if we want to have as many copies as possible. Not only that, since everyone would have their own copy, they don’t have to trust someone else’s copy altogether. It’s a great idea, and it already exists.\nA full Monero wallet is just that. It’s a wallet app with both the wallet keys (to send and receive) and a copy of all transactions. There’s a catch though. It has a copy of all transactions ever made by everyone in our money network. That’s hundreds of gigabytes. Ouch. If that’s the only option we have, our money would only be usable by people with a lot of storage. That’s not very practical. What about older cellphones for example? What about crappy computers in the hands of people that can’t afford newer ones?\nThe solution is to split that in two: having light-wallets that only have the keys and store the amounts belonging to them, and nodes on a separate device with enough storage to have a full copy of the blockchain.\nThere’s also another special kind of wallet that we could have, but to keep it simple, we’ll take a look at them afterwards."},"2-meraklilar-icin-proje-plani/accounts":{"title":"2.29 Accounts","links":["2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/subaddresses"],"tags":[],"content":"In real life, people have found it useful to have different boxes, buckets, envelopes, jars, to put in and store different money. We can assume that the money we invent will have to be flexible enough for that as well. People that use our money will have different use cases and sources for money. Not only between themselves, but also within each person.\nYou have money to spend and money to save. Money that comes from your main job and money that comes from gifts, or a side hustle. Money that you put away for a special holiday, and money that’s just a rainy day fund.\nThere’s a way to design our wallet system so all those use cases are possible, without the hassle of having to create individual wallets with individual keys that we need to be individually protected. We can subdivide our wallet into those jars or boxes.\nLet’s think of our wallet as a bank. When you open up a bank account you sign a lots of papers. That signature and documents are nothing else but the keys you’re identifying with at the bank. Your identity. Once you’re a client, you can have several accounts under the same identity. With our Monero wallets, we can do the same, we can generate almost endless accounts with the same pair of keys. It’s like opening lots of safety deposit boxes that open with a single key.\nThis example is important, because just like accounts or safety boxes in a bank, money can only be in one account at a time. If you deposit $100 into one account, it won’t show up if you look into another account. Every account will have different coins into them, therefore every account will have its own sum of all those coins, its own balance.\nIn practice, it’s like having multiple wallets inside a wallet. Amounts don’t get mixed up, and users playing our money game can have an account for savings, another for regular spending, another for all incoming donations, etc. It makes it all very tidy.\nBut what happens if we want to have the convenience of giving others multiple different addresses, but we also want the convenience of all those funds ending up in the same account? That we can achieve with subaddresses."},"2-meraklilar-icin-proje-plani/money_is_a_battery":{"title":"2.2 Para batarya gibidir","links":["2-meraklilar-icin-proje-plani/good_money"],"tags":[],"content":"Para geçmiş işlerimizin meyvelerini koruyabilmemiz için icat ettiğimiz\nbir varlıktır.  Kimi zaman bu meyveler daha çok şansla elimize\ngeçebilir; tipki başkalarından önce gizli bir gömüt bulduğumuzda\nolabileceği gibi.  Yine de, bence, bu durumda dahi, sen başkalarının\naksine, başkalarının bakmayı akıl edemediği veya reddettiği bir\nnoktaya bakma riskini aldın, cesaretini gösterdin, ve eylemini ortaya\nkoydun.  Aldığın bu risk ve ortaya koyduğun eylemle başkalarından\nziyade sen ödüllendirilmiş oldun.\nPara bir emek bataryası gibidir.  Onu şu anda, içine koyduğun emeğin\nmeyvelerini gelecekte kullanabilmek için, şarj edersin.\nTıpkı elektrik bataryaları gibi, para bataryalarının da en iyileri, en\nkolay şekilde şarj edilebilen, en uzun süre bu şarjı içinde\nsaklayabilen, ve en verimli şekilde içindeki şarjı tekrar açığa\nçıkaranlardır.  Bu üç işlev (saklamak, tutmak, ve kullanmak üzere\ntekrar açığa çıkarmak) para hakkında konuşurken de geçerlidir.  İyi\nnitelikte bir para kolayca elde edilebilen veya takas edilebilen,\ndeğerini uzun süre koruyabilen, ve ürün/hizmetlere yarın tekrar\nkolayca dönüştürülebilenidir.\nO halde, kötü bir paranın niteliklerini kolayca görebiliriz: elde\netmesi zor, değerini zamanla yitiren, ve ürün/hizmetlere çevirmede\npahalı.\nTıpkı elektrik bataryaları sayesinde konumumuz değişse de, duvardaki\nprize muhtaç olmadan, elektrikli aletleri kullanabilmemiz gibi,\nparanın icadı da bizim şu anki ihtiyaçlarımızın ötesine geçip, zaman\niçerisinde gelecekteki ihtiyaçlarımızı da tatmin edebilmemizi sağladı.\nSadece tüketmek yerine, üretme ve inşa etme eylemlerine geçtik.\nBu önemli bir gelişmeydi ve bizi bugüne taşıdı.  Şimdi, eğer bugün\nelimizdekinden daha iyi bir batarya yaratmak isteseydik ihtiyacımız\nolan şeylere bir bakalım."},"2-meraklilar-icin-proje-plani/subaddresses":{"title":"2.30 Subaddresses","links":["2-meraklilar-icin-proje-plani/stealth_addresses","2-meraklilar-icin-proje-plani/address_reuse","2-meraklilar-icin-proje-plani/accounts","2-meraklilar-icin-proje-plani/keys"],"tags":[],"content":"We’re designing our money in such a way that every time someone sends money to someone else, it writes a different, one-time-use address in the blockchain. That’s great because it protects the receiver’s identity from people just looking at the blockchain. But that alone doesn’t protect users. It’d be very cumbersome to have to create a new wallet with a different set of keys for every new address we need.\nAnd we don’t want to solve that issue by creating different accounts every time, because since every account has different balances, we’d need to send money from our own accounts to another account maybe even in the same wallet just to merge those funds together and being able to afford a pricier spend. Not impossible, but cumbersome. And we already decided that cumbersome is the enemy of usage. We want our money to be used, right?\nA solution is to use the same trick we used to generate multiple accounts from the same pair of keys, but now to generate multiple subaddresses for every account. We’ll call them sub addresses to differentiate them from the main, original address of our set of keys.\nThese addresses work like those old pneumatic tubes that were on every floor of vintage office buildings. You can insert a pod in one of many different endings, but they all end up in the same floor where they’re sorted out. Or just like veins in our body that all carry blood back to a single heart.\nSo, you can use a single account for your art commissions for example, but give a different subaddress to every client. That way, all your income from that source is on the same balance, but you can still be protected from clients that talk to each other to single you out. Also, it provides the extra benefit of automatically knowing who paid and how much, since every client only knows their corresponding subaddress.\nSubaddresses are very cool and useful."},"2-meraklilar-icin-proje-plani/quick_wallets":{"title":"2.31 A quicker wallet","links":["2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/full_wallet","3-the-blueprint-for-makers/light_wallets","2-meraklilar-icin-proje-plani/nodes","view_keys"],"tags":[],"content":"If we’re designing wallets for our money, there’re always going to be trade-offs. If we want our money to keep being private and self-custodial that is. Therefore, we can have different kinds of wallets that are better for different people or usages, each with their own pros and cons.\nOne of the downsides of a light wallet is that they have to ask an external node for the list of all new transactions, check them with your private keys, and see what’s yours and what’s not. That’s called syncing because when it’s done, you could say that your wallet and the node are synced with each other. That’s a downside because it takes time. The longer you went without syncing, the longer the next time is gonna take.\nThere’s a quick fix that we can use, kind of a hack. What if we give the node our view-key so it can check the list for us, and just tell the wallet much faster what’s ours and that’s all. That’s exactly what some wallets do. They can connect to special nodes that basically act as servers of our money transactions. They hold the view keys of wallets created in that system, and as they see new transactions coming in the new blocks, just like any other node, they check them agains the view keys they have stored. When the quick wallets connect to them, they just report the matching transactions, and it all feels pretty much instant to our users.\nThe downsides of these quick wallets is that you’re giving that node-server your view key, so they can see all the transactions you receive. You’re giving up your privacy as a receiver for speed. They see when you received money and how much, so you have to trust whoever runs that node. In this case, it would be better that you run it yourself, but that requires more technical knowledge and setup. See how there’re not perfect solutions?"},"2-meraklilar-icin-proje-plani/utxos":{"title":"2.32 Virtual bills","links":[],"tags":[],"content":"We can think and design a lot of rules and mechanisms to get money from one place to the other, but we need to come up with how that money is going to look like. Or better said, what would be the unit of that money?\nIn the real physical world, money is coins, or bills, or some old bill-like certificate. In our virtual money, we need a unit, an atom so to speak, that symbolizes our money when it’s stored somewhere. Pay attention that I’m not talking about the price, or how many of those units every bill represents, 10 or 10,000. I’m talking about the “bills” themselves.\nSince we’re in the virtual, mass-less world, we could have virtual bills that can split and merge like the T-1000 robot made of liquid metal. That’s super useful as a model, because we don’t need fixed amounts on virtual bills. So every time a user needs to send, let’s say 57 worth of money, our app can take a 100 bill, break it apart, create a new bill worth exactly 57, and a new “change” 43 bill for ourselves. The same happens if we have 3 bills we received previously all of them worth 20. We can merge them into a 57 new bill, send that, and create a little 3 change bill for us.\nIn cryptocurrencies, those bills are called UTXOs. It comes from Unspent Transaction Outputs, which is nerdspeak, of course. Let’s break it down.\nSomeone sent you money, that was a transaction. The money that you received came out of that transaction, it was its output. Until you spend that money again, it’s unspent. So the bills that you have in your wallet are unspent transaction outputs. You may be thinking, we shouldn’t let engineers name stuff, but remember, as a user you shouldn’t be learning all this, it should be invisible to you and just work. But here we’re creating a better money so for all purposes we’re all engineers."},"2-meraklilar-icin-proje-plani/sender_privacy":{"title":"2.33 Privacy for the sender","links":["2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/stealth_addresses","2-meraklilar-icin-proje-plani/utxos","2-the-manifest-for-believers/plausible-deniability","2-meraklilar-icin-proje-plani/ring_signatures"],"tags":[],"content":"When the users use their wallets to send money, basically what they’re doing is using their keys to sign a message and sent it to a node so it can broadcast it to the miners, and the one that finds the block gets to write that new transaction into the list.\nThat sounds all perfect, but there’s a problem. Nodes need to write down three things so a transaction makes sense: who is sending, how much is sending, and who is receiving.\nWe already have an idea to hide the receiver using disposable addresses. Can we use the same trick to hide the senser? Nope. It’s one thing to use a anonymous dropbox where I can put stuff in and I don’t care who comes later with a key to open and empty it. And we could decide that we don’t care to know who’s sending when we’re sending, as long as they’re sending something. It means that we don’t need to write down the address of the user sending, but we do need to write down which virtual bills are being sent. The things is, we need a way to hide which specific bills we’re sending so no one can guess who’s the owner of such bill, based on who received it in the first place.\nThis is a very tricky and sticky problem. The way we can solve this in Monero (at least for now) is to write down the real bill in the transaction, but also write other bills as a decoy. It’s not an absolutely bulletproof solution, but it gives users plausible deniability.\nWe can use ring-signatures."},"2-meraklilar-icin-proje-plani/ring_signatures":{"title":"2.34 Ring signatures","links":["2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/utxos","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/stealth_addresses","2-meraklilar-icin-proje-plani/decoy_selection"],"tags":[],"content":"Every time a new transaction is created, the wallet will take a look of all the bills received in the past by everybody, and pick 15 of them. Mix them with ours, and broadcast the transaction using a very special kind of cryptographic signature which says: “I can prove that one of these bills is the real one, but without telling you which one”.\nThat way, when you take a look at the transaction on the list, it looks like every transaction involves 16 bills that were received at some moment in the past by someone on a one-time address, so we’re pretty lost.\nYou can already see that this is not super perfect privacy but it’s pretty good. You could make guesses, and there are some ways in which this set of 16 can be narrowed down, but you’ll almost never be able to say with 100% certainty which one is the true bill being spent.\nThe trade-off is that we’re writing down 15 fake bills on every transaction, which takes more space on the list, and a bit of extra power to verify. That’s the reason we’re not using 100 or 10,000 bills in our ring signature. In the future, there are ideas to use a newer, different kind of math that could hide every bill in between all of the bills ever received. It’s still less battle tested, but that would be the final solution to this problem.\nAs a side note, we need to be clever in the way we choose which bills to use in the ring, otherwise it’d be very easy to spot the true one."},"2-meraklilar-icin-proje-plani/decoy_selection":{"title":"2.35 Decoy selection","links":["2-meraklilar-icin-proje-plani/ring_signatures","2-meraklilar-icin-proje-plani/stealth_addresses","2-meraklilar-icin-proje-plani/utxos","2-meraklilar-icin-proje-plani/random","2-meraklilar-icin-proje-plani/ringct"],"tags":[],"content":"We need to come up with a system to pick which bills to use in every ring signature.\nPicture a literal pool full of the bills that everybody has. Every bill has a fake name written on it, so if we look at them we don’t know who the owners are, unless it’s us (with our fake names), of course. Now we need to send our bill to someone in an envelope, but we’re worried that the mailman, will open the envelope, and see whose bill that is.\nThat’s why we’re hiding the bills we send in between other bills received by others, so we should come up with a logic to pick those bills from the total pool of bills. If that logic is predictable, it’s worthless. Anyone can discard the decoy bills with ease. The most obvious idea would be to pick them randomly. But real randomness is really hard. And worse, if we achieved perfect randomness, it would be worse. Why? Because real life is not totally random. You don’t wake up one day and the sky is neon green, or you grew an extra arm during the night, or people in the street are walking backwards. There’s a pattern to life overall, and there’s certainly patterns of how people use money. Therefore, if we make the selection of decoy bills too randomly, the real bill sticks out.\nSo how does normal use of money look like? well, it looks like a curve a bit leaning to the right. On the extreme left we have the oldest bill sent (created), and at the extreme right we have the newest. Most bills that are send again are somewhat new, but not super new.\nWhy’s that? Imagine someone that receives the bill as a salary for their work. If he or her hasn’t spent that bill in 4 years, is it more likely that spent it tomorrow, or save it for 1 more year? Same if payday was today. Is it more likely that that new bill is spent again in the next 5 minutes or in the next week? Those are the patterns of real life. So our algorithm should be random enough that the picks are not predictable, but weighted towards picking more often bills in the middle of the curve. We cannot discard the rest altogether, or we wouldn’t be protecting those long term savers or incontinent spenders, but they’re not the majority.\nIf we’re already protecting the sender and the receiver, there’s one more big thing we need to hide: the amount."},"2-meraklilar-icin-proje-plani/ringct":{"title":"2.36 Hidden amounts","links":["2-meraklilar-icin-proje-plani/sender_privacy","2-meraklilar-icin-proje-plani/stealth_addresses","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/dynamic_blocks"],"tags":[],"content":"For our money to be private it needs to hide the sender and the receiver every time it changes hands. But it also has to hide the amount. Why’s that? If we cannot tell who’s sending to whom, why would it matter to know how much? Well, you could use very specific amounts to deanonymize people. Either by requesting a particular sum and discovering the true sender, or by sending money to someone to track the amounts as they move or cash out based on amounts and timing. There are many attacks that could be performed, and on top of that you could build a very nice and telling graph of money flowing through the network.\nTo solve that we can use RingCT, which is short for Ring Confidential Transactions. In a very, very simplified explanation of what they do, they hide the amount in a way that it can be verified that the amount is correct, without disclosing it. Sounds like magic, but it’s not. It’s cryptography.\nThey use two main math tricks: Pedersen commitments and Range Proofs. The former ensures that the amount the sender is sending is somehow locked and won’t change until it’s revealed at he other end by the receiver. And the later ensures that the mysterious amount is within the possible amounts and not doing anything funny, like creating Monero out of thin air, or sending more than the user has.\nThe result is that nobody will be able to see any amounts in the list and now our super secret transactions are ready to be written down in the blocks we mine. We just need to come up with a way to ensure that these transactions have room on the blocks and don’t get stranded on a forgotten bus stop at 2am forever."},"2-meraklilar-icin-proje-plani/dynamic_blocks":{"title":"2.37 Elastic blocks","links":["2-meraklilar-icin-proje-plani/blockchain","1-the-manual-for-users/send_monero","1-the-manual-for-users/receive_monero","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/difficulty_adjustment","2-meraklilar-icin-proje-plani/clock","2-meraklilar-icin-proje-plani/miners","network-effect","2-meraklilar-icin-proje-plani/money_is_a_battery","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/consensus","2-meraklilar-icin-proje-plani/spam","2-the-manifest-for-believers/liquidity"],"tags":[],"content":"Our money works with a blockchain made out of… well, blocks chained together. Every block contains a list of the newest transactions made, when someone sent and someone received. All those blocks together are like pages of our super long money shared book. We already decided that those blocks should come approximately every two minutes. Which is useful, and works like our own synchronized money universal clock. But if the pace of new blocks is somehow fixed, what happens if a lot of people wants to make new transactions, all of them at the same time?\nSame thing that happens when we have to ride the subway at rush hour. Cars are packed until there’s not space for a hamster, and you cannot even squeeze in. The train leaves the platform, and you have to wait for the next one. You could make the cars bigger, so they hold more people. But what happens after rush hour? They’re empty. They waste energy to move those huge cars around, they take space at the garages, they’re costly to build and maintain.\nSame happens with our money blockchain. If we make blocks too small, every time there’s more traffic or interest in using the currency, people are left waiting for the next block to get their transactions made. Or several blocks. If you decide to rise the price of tickets (the fee paid to miners) our money would only make sense for big transactions. Most people are not rich, so our money won’t be used by most people. If our money is not used by most people, it won’t have network effect, and lose value. And if our money doesn’t have value, it won’t work as a wealth storage. Game over.\nIf we make blocks too big, we put a strain in our infrastructure. For example, people running nodes will see the size of the blockchain grow very fast, the hardware needed to run a node gets more expensive, therefore less people run a node. If less people run nodes the network gets centralized, and when consensus depends on a few actors, they can easily misbehave. When people see that money depends on a few individuals’ whims, they tend to prefer other money that is more independent. If people stop using the money, game over again.\nWhat could be a solution? Make the blocks dynamic. Again, thanks to the magic of not having to deal with the constraints of the real physical world, we can have magic subway cars that grow during rush hour and shrink during low demand. And to decide how much to shrink or grow them, we’ll take the median size of the last 100 blocks, and see how filled they were. Then change the size carefully until balance is achieved again. With this design, changes are never extreme, people running infrastructure can adapt, and users can welcome adoption of the currency with a smile on their faces. More users doesn’t mean worse experience, on the contrary, it means more useful money"},"2-meraklilar-icin-proje-plani/spam":{"title":"2.38 Spam attack!","links":["2-meraklilar-icin-proje-plani/dynamic_blocks","2-meraklilar-icin-proje-plani/bizantine_generals","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/money_ledger","2-the-manifest-for-believers/borderless-money-is-better-money","2-meraklilar-icin-proje-plani/ring_signatures"],"tags":[],"content":"It was a great idea to make our blocks change size with demand, that way our money network can remain lean and cheap to run during times of less use, and quick and useful when it becomes popular. But remember that our money works because of a delicate balance of incentives. If those interests get out of whack, someone is gonna attack or profit from the other, or both. If someone can do that, people won’t trust it, and our money would die.\nIf miners profit from the fees that users pay to get their transactions written in the money ledger, they would have an incentive to make the blocks as big as possible. Bigger blocks, more transactions, more fees, more money. But if they do it quick, a miner could make a gigantic block and mess the whole thing up. To avoid that, we’re not only making the size of the block dynamic, but also the fees received. If there are more transactions pending, the price to get them written on blocks shrinks. That way, the income of miners doesn’t suffer, it’s predictable, and the network is not spammed.\nWhat do I mean by spam? Just like email spam, if we make transactions free or almost free, it would be very cheap for an attacker to just make millions of transactions to clog up the network for the real users. If a government doesn’t like our money (probably because it’s better than theirs) we should add a mechanism so that any big player trying to use our money too much, instead of hurting us, help us.\nWith this design, miners can’t abuse the fee system, node operators won’t see their copies grow uncontrollably, users will see their transactions confirmed quickly, and if someone tries to spam the system, it’s just as good as if the system became more popular. More fees for miners, more miners for the network, more decoys to pick from, and why not, more publicity."},"2-meraklilar-icin-proje-plani/emission_curve":{"title":"2.39 Emission","links":["2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/scarcity","2-meraklilar-icin-proje-plani/tail_emission"],"tags":[],"content":"We have already decided to use mining to release new coins for the users of our money and to ensure some scarcity so that our money doesn’t become eventually worthless.\nBut why don’t we just release all the coins at the beginning and call it a day? Well, let’s think it through, there are two main reasons: one is security. Remember that we’re using the newly minted coins to pay those miners to maintain the security of the network. Without the incentive of earning money, there would only be altruistic miners, which is not a super sustainable plan.\nThe second reason is fairness. If we release all the coins at once, who are we giving them to? Let’s say there are 10 of us creating the money, and we share all the coins between us. What would be the incentive for someone else to buy our coins to use them, since we hold so many of them? We’d be eternally richer than everybody else, which would look (and sincerely be) pretty unfair. And when people feel a game is unfair, they don’t want to play. The only unfair games that people take part of are those where they’re forced to play, like the current banking system. We’re trying to create something better here.\nAgain, incentives. We need as many people as possible to adopt out money for it to grow in value (it buys more things per coin and it’s accepted by more people). So the plan is to release the new coins progressively over time. And one smart way to do it is to release more coins at the beginning and a bit less and a bit less over time. Why’s that? Again, balance of incentives. When our money is new and not many people use it, it’s less useful, it’s more of a risky bet, because it hasn’t proved itself by a track record of being good money for years and used by millions. So, for those persons willing to exchange other moneys for ours, or willing to spend electricity mining it, when it’s still very early, we give them more coins. As time progresses and more people get on board, we give everybody less and less. It makes sense.\nWhen we draw this in a graph, it looks like a curve. People call this the emission curve. At the bottom left no time has passed and no coins are minted. As we move to the right, time goes by, and the amount of coins in someone’s hands increases, fast at first, slower afterwards.\nWhat happens when we reach the top right corner? In that moment, all the coins are out there and there are no more left to reward miners. Bitcoin for example works like this. But there’s another way, we can add a 2.40-tail_emission."},"2-meraklilar-icin-proje-plani/good_money":{"title":"2.3 İyi para","links":["2-meraklilar-icin-proje-plani/money_rules"],"tags":[],"content":"Uzun bir süredir paranın farklı şekillerini icat edip durduk.  Bu\nnedenle elimizde, eğer onun iyi bir şekilde şarj edilebilmesi, şarj\ntutabilmesi ve verimlice deşarj olabilmesi için, çoktan bir gerekli\nnitelikler listesi var.  Paranın taşıması gereken özellikler:\n\nSınırlı (ing.: scarce)\nMerkeziyetsiz (ing.: decentralized)\nEşnitelikli (ing.: fungible)\nDayanıklı (ing.: durable)\nBölünebilir (ing.: divisible)\nTaşınabilir (ing.: transportable)\n\nBu özelliklerden herhangi birinin neden gerekli olduğu konusunda\nkafa yorabilirsin, fakat bu patikada konuyu elimize alarak\ninceleyeceğiz, ve onun sıfırdan nasıl çalıştığını\ngöreceğiz."},"2-meraklilar-icin-proje-plani/tail_emission":{"title":"2.40 The long tail","links":["2-meraklilar-icin-proje-plani/emission_curve","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/fees","2-meraklilar-icin-proje-plani/scarcity","2-meraklilar-icin-proje-plani/difficulty_adjustment"],"tags":[],"content":"We’re distributing our money in a way that looks like a curve. It starts at the beginning of our currency’s history when no coins were created yet, and goes into the future when eventually all the coins are out there in the hands of someone. But what happens when we reach the end of that curve and we don’t have any more new coins for the miners?\nWithout money to be made, it’s reasonable to think many (if not most) of the miners will just stop mining. After all, it costs to mine. You have to buy the hardware for it and pay the electricity bill as well. And in our money design, we need miners for it to work.\nA possible solution to this problem is to add fees to our system, which are useful for more than one reason. But if miners have to rely on fees alone to be profitable, we’d need those fees to be quite high. If fees are high, our money becomes expensive to use, therefore it’ll be used less. And the lesser our money is used, the higher the fewer fees need to be. It’s a spiral of death.\nAnother solution is to just never stop creating new coins. Make the emission curve endless. But wait, isn’t that contrary to the scarcity we needed for our money to be considered good money? Well, yes and no. As with many things in life, it depends. Eating food is good for you, eating too much (or too little) is bad. Same thing happens with our coin creation: success or failure lies in how much, how often. That balance is struck with a tail emission. A emission that comes after the initial curve is completed. Just like the tail of a cat comes after the rest of the cat.\nIn the case of Monero, the tail emission started approximately after the first 18 million coins were out. Then, for every new block the system started paying the lucky miner 0.6 new moneros. Since we’re aiming for those blocks to be created every 2 minutes, that means that we’re creating 157,788 new moneros per year. With that, we’re ensuring that regardless of how many new transactions we have in those 2 minutes, miners will want to keep creating those blocks. We didn’t need to rise the fees, our money keeps being cheap and convenient to use, and the list keeps being protected of vandalism by our extended network of profitable miners.\nThere’s a last little trick. If we make the tail emission a fixed number (0.6 in this case), the devaluation of our money decreases with time, instead of accelerating."},"2-meraklilar-icin-proje-plani/asymptotic":{"title":"2.41 Asymptowhat?","links":["2-meraklilar-icin-proje-plani/tail_emission","2-meraklilar-icin-proje-plani/emission_curve","2-meraklilar-icin-proje-plani/clock","2-meraklilar-icin-proje-plani/how_much_money"],"tags":[],"content":"If we choose to have a tail emission in our money after the initial emission curve, it means that technically the amount of coins is going to be infinite. With every new block new coins are born, so if we keep creating blocks we’ll keep creating coins as well, those new coins are added to the already existing quantity of coins in circulation, therefore dilluting the value of each coin.\nHere’s where the tail emission being a fixed amount comes in handy. Let’s say our initial emission is 100 coins, and then we add a constant tail emission of 1 coin per block. The moment that new coin is out, it instantly made the other 100 worth a little less, because now there are 101 coins to purchase the same amount of stuff. We could say that roughly, it’s worth 1% less. But what happens if we keep doing it? Well, it’ll keep happening and our money will keep diminishing in value. At which rate though? At less than 1%. When we create the second new coin, there are 102, then 103, and so on. But if we calculate the percentages, they’ll be 0.9%, 0.8%, 0.7%… What’s going on? What’s happening is that every new coin is a smaller part of the big pile of existing coins. That means that with every new coin the entire set of coins loses a tiny bit less value than before.\nThat’s called asymptotic. It’s a term for a number that gets closer and closer but never totally reaches a certain value. In this case, the inflation percentage gets smaller and smaller yet never gets to zero. Is it still technically infinite? Yes. But so do coastlines for that matter."},"2-meraklilar-icin-proje-plani/fees":{"title":"2.42 Fees","links":["2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/emission_curve","2-meraklilar-icin-proje-plani/ringct","2-meraklilar-icin-proje-plani/utxos","2-meraklilar-icin-proje-plani/difficulty_adjustment","2-meraklilar-icin-proje-plani/block_time"],"tags":[],"content":"We have a nice looking, decentralized beauty of a money network going on. Now, getting serious and in legalese: how are we covering the costs of maintaining such infrastructure?\nWe have basically two different participants on our network: the miners and the nodes. We can allow the nodes to make no money, so there we cut some costs. We can do that because on one side running a node is not energy intensive, and pretty easy to maintain, so basically cheap. And the incentive of having your own copy of the list to verify your transactions yourself is a pretty good trade for a couple of gigabytes of your hard drive. Ideally every user would be a node, but the world isn’t ideal.\nMiners are another thing altogether. In order to secure the network they need to compete with each other and spend as much computing power (hardware plus electricity) as they can. The better the computer and the more they run it, the more they receive. But remember that this system has to work without anyone in charge telling nobody what to do. It’s decentralized. So we have to come up with another incentive for the miners to write as many transactions in the new blocks and not just mine empty ones. That incentive are the fees.\nEvery time a miner is asked to write down a transaction in our shared list, the sender must pay an extra amount, like a tip for the miner’s services. And that fee cannot be just flat. The bigger the transaction, the bigger the tip needs to be, because since the blocks are not infinite in size, if a transaction uses more space it would never be written. Why is that? Think about it. As a miner, if every transaction pays the same fee, I rather write a lot of small ones than a few big ones. So that’s why the size of the transaction to be written is proportional to the price of the fee.\nBut wait a minute. If the amounts in our transactions are hidden, why are some bigger or smaller than others? Because we’re using those virtual bills. If our transaction requires to write several small chunks of money to add up to the amount we need, all those pieces need to be written down in the details of the transaction, even if they’re hidden. Therefore, the transaction uses more space in the block.\nThis way, everybody can have their money sent back and forth, and miners get two revenue streams to rely on, making the whole thing more predictable and sustainable. And since we’re talking about predictable, what can we do to ensure the new blocks at a regular pace?"},"2-meraklilar-icin-proje-plani/block_time":{"title":"2.43 A couple of minutes","links":["2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/emission_curve","2-meraklilar-icin-proje-plani/fees","2-meraklilar-icin-proje-plani/mempool","2-meraklilar-icin-proje-plani/fork","2-meraklilar-icin-proje-plani/difficulty_adjustment"],"tags":[],"content":"We’re designing a system that is decentralized, but one thing that is always difficult to do when we have a group of different people is to coordinate. Just like picking a date to have dinner with 5 friends, it’s hard to reach a consensus. But our money should work predictably (or at least as predictable as possible) otherwise it’d be maddening for people to use it. One of the things that have to be predictable and regular is how long does it take for someone to transfer money. Pay or get paid for something, basically.\nWe’re using miners that write every new transaction on the ledger and get paid block rewards and transaction fees for that. Since money changes hands once a transaction is actually written on a block, we need then to decide how often new blocks are created. That’s gonna be the speed of our money. So how often is often enough?\nWell, we would be able to see them almost instantly on a pool of pending transactions, but for a transaction to be the real deal, it’s gonna take at least until next block to be final. So, it’d be better to have the blocks as often as possible. There’s a catch though, remember that the blocks are sequential? That means they form a line of one after another, just like a train with cars on a single rail. The miners compete with each other to create and put those cars on the rails as fast as possible, so if we make the time between turns too short, they’ll cram and many will shout “First!” at the same time. Or they’ll each create their own fork of the rails and call it the “real true rail”.\nOn the other hand, if we make the time between blocks too long, people will stop using it because it’ll feel like sending a pigeon with a bill attached to its leg just to buy groceries. So there’s a sweet spot. In Monero that sweet spot is 2 minutes. A new block every two minutes.\nGood idea. Not too fast, not too slow. But let’s back up a bit, if it’s decentralized, how do we coordinate miners to mine the blocks every 2 minutes instead of whenever they wish to?"},"2-meraklilar-icin-proje-plani/difficulty_adjustment":{"title":"2.44 Balancing act","links":["2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/block_time","2-meraklilar-icin-proje-plani/emission_curve","2-meraklilar-icin-proje-plani/money_rules","2-meraklilar-icin-proje-plani/mempool"],"tags":[],"content":"We need a mechanism to coordinate miners to make new blocks every two minutes. And we cannot rely on any centralized clock to tell us the time, so what can be do? Well, remember that the way we picked which miner got the price and could write the next block was by making them all do crazy hard math calculations until one of them got it right before the others? Well, that outcome is pretty random, since it’s designed not to be a predictable outcome (otherwise what’s the point) so it may very well be that the miners will take very different times to find those results. That would mean that we would have very different times between new blocks, rendering our money chaotic and unreliable. We don’t want that.\nBut, what we could do is to change how difficult the number the miners have to find is with every round, so in average it takes them 2 minutes to find it. Mind-blown moment right there.\nMonero does that to ensure the time it takes for you to get your new transaction written on the next block to be two minutes in average. The protocol looks at the time lapse between the last 700 or so blocks, trims the 100 ones that are either too long or too short, and makes an average. If the average is shorter than 2 minutes, it’ll proportionally rise the difficulty of the next number to guess so it takes longer. The system does this with every block, so the averages (and difficulties) don’t change dramatically. If the time between blocks is longer, it lowers the difficulty of the ruffle’s next round.\nThis self-balancing act is simple yet super effective and stabilizes the whole system, allowing it to adapt to new situations without having to rewrite the rules of the game. It’s like your body that can breathe faster and deeper if we need to pump more oxygen faster to our muscles, and run from a lion (or a thief), and then breathe calmly to save energy and rest once we’re safe.\nNow that we got the miners to release blocks in tempo, where can they find the transactions to include in those blocks?"},"2-meraklilar-icin-proje-plani/mempool":{"title":"2.45 Transaction limbo","links":["2-meraklilar-icin-proje-plani/money_is_a_battery","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/mempool","2-meraklilar-icin-proje-plani/wallets","2-meraklilar-icin-proje-plani/utxos","2-meraklilar-icin-proje-plani/keys","2-meraklilar-icin-proje-plani/fees","2-meraklilar-icin-proje-plani/fork"],"tags":[],"content":"We have users who want to send the money from one address to another, miners who will write those into new blocks, and nodes who will store a copy of that list with transactions just in case. But how can we actually get a transaction from being basically a request in your wallet to a reality in another person’s wallet? How do wallets tell the miners “Hey I have a new transaction! Can you write it down?” If we connect directly with the miners, they could know where or who we are. And it would be super inefficient. Do we have to send a message to all miners? How do we even know who they are?\nWhat we can add is something like a scratch pad for transactions that are so new they haven’t yet got included in the upcoming block, pending transactions so to speak. We write them in there in the meantime, and then toss the page away once they’re written properly. That way we kind of quickly know if the transaction exists, before it gets recorded forever. Like a subway platform for transactions, you can see them waiting, already paid their ticket, but still waiting for the train.\nThat disposable pad is called the mempool, short for memory pool. It’s like a big, well… pool filled with envelopes of letters that have not been sent yet. How does it work? Let’s follow the path step by step. First the wallet creates a transaction by grabbing one of the bills you have and signing it with your key so it’s official. Then it connects to a node and tells the node about it. This is your point of entrance to the network. Remember how nodes are sharing their list copy with each other to compare and make sure that they all have the same one? Well, they also share between them the signed transactions waiting for miners to pick up. That shared and dynamic (because it changes all the time) list of pending transactions is the mempool. So the transaction gets replicated from one node to the other, until it reaches almost all of them.\nYou can see this live mempool list of pending transactions on a explorer. You can also see their size and the fees they paid. Remember that miners are connected to nodes too, so they can see this, and automatically pick from this pool the transactions that better suit their interests (the smaller and pricier the better). So the miners are all the time constructing that ideal next block of transactions just in case they’re the lucky one that wins the random lottery. The moment one of them do, it submits the solution to the others, grabs stuff from the mempool, makes a new block, tells others about it, and goes back to mine for the next one. Done, our transaction is now official and cannot be taken back unless we somehow convince most of all other miners and create a new version of reality."},"2-meraklilar-icin-proje-plani/fork":{"title":"2.46 Fork this","links":["2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/blockchain","2-meraklilar-icin-proje-plani/money_rules","2-meraklilar-icin-proje-plani/consensus","2-meraklilar-icin-proje-plani/good_money","2-meraklilar-icin-proje-plani/randomx"],"tags":[],"content":"We have a system set up where (hopefully) a lot of different nodes and miners work with their own individual interests at heart, and almost magically sharing a common goal of maintaining our money working. Every node has a copy of the list with who has how much money, and every miner spends electricity, wins a lottery, gets permission to write on that list, and gets paid for it.\nWe know where the transactions are written and why they cannot be changed. Have you wondered where the rules of our money are written? Because it’s one thing to ensure that nobody cheats by creating money out of thin air for themselves, or erasing a payment after receiving some bought goods, but what happened if they changed the rules themselves? We need what’s called consensus around our rules. An agreement not only on what money got send where, but how the game itself is played. To achieve that, we can write the rules on every program playing the game. It’s like every player getting their own printed rulebook. And every time they play with each other, they check that they have the same rules. This is useful for two reasons, one is to ensure that it’s the same money that we’re using, the other is to be able to change the rules.\nWait a minute. Isn’t changing the rules bad? Well… it is, if we don’t all agree we want them to change. Think about it for a moment. Things change in the world, new tech is developed and new ways to hack systems are discovered all the time. If we want our system to be resilient, which means that it not only can resist attacks but also that these attacks can be used to learn, adapt, and make it stronger every time. Like our own muscles, which break a tiny little bit every time we exercise them (that’s why they hurt), but then regenerate bigger and stronger, ready for harder tests.\nSo we want a dynamic way of voting and agreeing on changes. We can use miners for that. We can make changes to the coins’ rules, apply them to the programs used by miners and nodes, and wait to see if they adopt them. Every time the rules change, the blockchain forks into two. It’s just like in time travel movies, when by changing an event in the past, you created an alternative universe. This is the same. Some miners will not use the changed rulebook, and therefore keep building blocks on the original blockchain, while some miners will use the new rules, instantly creating a new blockchain from that moment on. In blockchains that’s called a fork, just like a fork in the road, or the way forks branch from a single handle into many pointy ends.\nWhen most of the miners (more than half of them) agree on what to fork to, the blockchain (and therefore the money) will be consider the same as it was, just upgraded. If the changes are adopted by a minority, that branch will be consider a fork and a new, different money. This new money won’t be compatible with the other from now on. That’s what happened between with Bitcoin and Bitcoin Cash back in 2017, for example.\nWe’re almost there with our super good money. Now that we have decentralized way to vote for changes, we need to ensure the miners themselves do not become centralized. That is, there’s a small group of like five miners that agree between them what to change to. Remember than the fewer people making decisions at the top, the less likely those decisions will be in the best interests of the huge number of money users in the bottom. We’d be replicating the current financial system, in a way. To avoid that, we need to keep them guessing."},"2-meraklilar-icin-proje-plani/randomx":{"title":"2.47 Shuffling the piano","links":["2-meraklilar-icin-proje-plani/good_money","2-meraklilar-icin-proje-plani/money_is_a_battery","2-meraklilar-icin-proje-plani/nodes","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/fork","2-the-manifest-for-believers/stop"],"tags":[],"content":"One of the very much important characteristics of our money is that it’s decentralized. Having nobody at the top deciding who can send or receive money is key, nobody would want to voluntarily store their time and effort in something that can be taken away on a whim. To achieve such decentralization, we shared the work of running our network between nodes and miners. But for that idea to work as we intended, we need to ensure all of them remain decentralized.\nNodes are easier to decentralize because running a node is cheaper, and if you use the money yourself, you’re already incentivized to have your own copy of the record that says who owns what. You want that list to be in as many places as possible, it’s your money after all.\nBut miners are a bit more tricky. Someone might mine to make money and not to use money. They might be altruistic and all warm and fuzzy inside, but their incentives are to maximize profit. When you want to maximize profit you tend to do two things: get better and get bigger. One of them is solvable, the other is… let’s say combatible.\nRemember how miners were basically using computers to try to guess a very difficult number? Well, it happens that if the math they have to do is always the same, you can get better at it. Just like someone that doesn’t know how to play piano if you challenge them to play a particular song. They will start to press keys randomly until they make kinda sense, they’re ordered from bass to treble, left to right. They hum the song and try one key after another, and eventually with a lot of trial and error, they play it. What’s going to happen if you ask them to play a different song next? You can bet they’re faster than the first time. They got better at it. The same happens with mining. If we use the same algorithm to guess the next lucky number, and people are making money out of it, then you can bet people are going to invent better chips to do that. Those newer chips would be optimized for that particular algorithm. The maker of those chips would be a bit faster than anyone else at getting a reward. With that reward they can make more optimized machines, and charge a premium for them. Eventually, the only remaining miners are the profitable ones, and they’re a small bunch of very rich participants. Now you have a minority deciding which transactions are worthy of being written, who gets to use our money, and above all else: what’s the true money.\nRandomX was developed by Tevador and many others to attack this problem. It randomly changes the mining algorithm. It’s as if every time our novice piano player managed to unlock a new tune, we took all the keys out and scrambled them. It’d be very, very hard to get better at piano like this. Since RandomX changes all the time, the best chip at it would be a chip that could tackle all those different problems, and that happens to be a CPU. The brain of your computer is a multi-purpose tool. RandomX demands that you use a swiss army knife for everything, it may not be the best tool for any particular need, but if you can carry only one tool for an unknown need, it’s your best bet.\nThere’s a secondary outcome of this approach that is useful to combat miners getting bigger. You cannot avoid participants that have more money, buy more machines, have bigger deals with electric companies, have dedicated employees, etc to outperform you at this. That’s called economies of scale. But we can minimize its effects with something like RandomX. Since it works best in all-purpose machines, it’s more likely that more people with have them because they need them for other things. So they’d already own the machines, and you’re only throwing a cherry on top by allowing them to also mine our money. The more miners the more our network decentralizes, and therefore the better money we have.\nLet’s take this brief moment to bask in the warm afternoon light beams hitting our smiling face and enjoy knowing we designed a pretty damn good money.\nThe moment flies by, a small cloud covers the sun and we open our eyes. A tiny insidious question fades in coming fast toward us from the back of our mind like a exit sign on a night highway: Why doing all this?"},"2-meraklilar-icin-proje-plani/money_rules":{"title":"2.4 Para oyunu","links":["2-meraklilar-icin-proje-plani/value_vs_price"],"tags":[],"content":"Para beş para etmekte çünkü en az iki kişi bu konuda oydaş.  Aksi\ndurumda, eğer onu kullanarak bir şey satın almak istediginde\nkimse onu kabul etmezdi.  İki birey (bir satıcı ve bir alıcı)\narasındaki bu anlaşma paranın çalışmasını sağlayan temel şeydir.\nTıpkı bir oyun oynanırken olduğu gibi burada da kurallar vardır.\nOyunu oynayan kişiler bu kurallara göre oynamayı kabul ederler.\nBu kurallardan birisini tek başına değiştirmeye karar verirsen,\ndiğerleri ile aynı oyunu oynamaktan çıkmış olursun.\nÖrneğin, futbol oynarken bir anda topu eline alıp kale içine koşarak\ngol atmayı seçersen, senin oyun arkadaşların bunu kabul\netmeyeceklerdir.  “Haydi futbol oynayalım,” dediğiniz anda hepiniz\nayaklarınızla oynamayı kabul etmiştiniz.\nPara da bu çeşit bir anlaşmadır.  Ona bir protokol de diyebiliriz.\nTıpkı bir oyunda olduğu gibi, paranın da pazardaki herkes tarafından\nkullanılırken uyulan kuralları vardır.  Örneğin: paranın adı\n“dolardır,” ve eğer bunlardan 5 taneye eşit olan bir ücret istedigin\nzaman “Bu 5 dolar eder” dersin, ve diğer birey senin 5 tane keçiden\nfalan bahsetmediğini anlar.  Bir diğer kural ise eşit büyüklüklerdeki,\nbelirli bir mürekkep ve tasarımla basılmış, belirli miktardaki\nbirimlere denk gelen dikdörtgenlerin, “banknotların”, kullanılmasidir.\nBir diğeri ise paranın sadece sent miktarlarına kadar\nbölünebilmesidir.  Olayı kavramışsındır.\nO halde, yeni bir para yaratmamız için, bizim en iyi kuralları\nseçmemiz gerek.  Bu kurallar oyunumuzu ya kuracak ya da bozacak, ve\ndiğer bireylerin bizimle oynamayı istemesini sağlamakta ya başarılı\nolacak ya da başarısız olacak."},"2-meraklilar-icin-proje-plani/value_vs_price":{"title":"2.5 Değer ve Fiyat","links":["2-meraklilar-icin-proje-plani/how_much_money"],"tags":[],"content":"Deneyimimizden biliyoruz ki para değerlidir.  Fakat bu isabetli\ndegil, daha çok bir yanılsama.  Para sadece değer saklar.\nBir elektrik bataryası bir nükleer reaktor veya bir rüzgar türbininin\naksine enerji üretemez.  Bir sürü bataryayı bir araya koysan da,\nonları şarj etmediğin sürece elinde işe yarar bir şey olmayacaktır.\nAynı şekilde, bir para yaratmak kendiliğinden bir değer de yaratmaz,\nbu değer başka bir yerden gelmek zorundadır, mesela onu elde etmek\niçin yapılan iş ve üretimler.\nBir şeyin değeri onu başkalarıyla değiş tokuş etmek istediğimiz an\naçığa çıkar.  Eğer evimizde bir çanta dolusu altın var da, fakat kimse\nonun karşılığında bize bir şey satmayacak veya vermeyecekse…  onun\ndeğeri nedir?\nBaşkasına bir teklif yaptığımızda olası olarak bir fiyat ortaya\nçıkar.  Diğer kişinin fikri bizimkinden farklı olabilir (hatta çoğu\nzaman öyledir).  Satmaya gönüllü olduğumuz fiyat ve diğer kişinin\nvermeye gönüllü olduğu fiyat buluştuğunda ortak bir fiyat ortaya\nçıkar.\nAncak bundan sonra bir şeyin değerini bilebildiğimizi söyleyebiliriz.\nElbette, sadece bizim değerli bulup da başka kimsenin değerli\nbulmadığı şeylerimiz olabilir.  Örnek: ilk okuldan kalma eski bir aşk\nmektubu.  Fakat para bu şekilde çalışan bir şey değildir.  Eğer iyi\nparadan bahsediyorsak, onun olabildiğince fazla sayıda birey için\nolabildiğince yüksek değeri olmalıdır.\nBunu ortaya koyduğumuza göre, bakalım ne kadar paraya ihtiyacımız\nvar."},"2-meraklilar-icin-proje-plani/how_much_money":{"title":"2.6 Sanal fakat değerli","links":["2-meraklilar-icin-proje-plani/money_ledger","2-meraklilar-icin-proje-plani/scarcity"],"tags":[],"content":"Eğer bir sanal para yaratacaksak sanallığın yanında getirdiği bir\nözelliğe karşı önlem almamız gerek.  Sanal şeyler kolayca ve\nücretsizce kopyalanabilir, ve bir kere kopyalandığı zaman, her kopya\nbir önceki aslı gibi aynı niteliktedir.  Sanallık ile ilgili geri\nkalan her şey, mesela dünyanın bir yerinden diğer ucuna saniyeler\niçinde fotoğraf atabilmek, çok iyidir.\nFakat, eğer gerçek paradan söz ediyorsak, paranın sınırsızca\nyaratılmasını engellemeliyiz.  Sınırsızca para yaratmak ilk bakışta\nkulağa çok iyi gelen, fakat getirdiği sonuçlarla çok da iyi olmadığı\nanlaşılan fikirlerdendir.  Tarih boyunca sınırsız para yaratımı her\nseferinde o bol parayı kullanan toplumlar için kötü sonla sonuçlanan\ntekrarlara sahip.\nBasitçe, eğer para miktarını iki katına çıkarıp satın alınabilecek\nürün miktarını aynı tutsaydın, eninde sonunda ürünler için ödediğin\npara miktarı da iki katına çıkacaktı.  Başladığın yere geri dönmüş\noldun.\nÖrneğin, düşün ki 100 kişimiz bir adada yaşıyoruz, ve para olarak\nkullanabilmemiz için 100 adet pul yarattık, yani kişi başına 1 pul\nvar.  Adada bir tane elma ağacı var.  Ağaç 100 elma veriyor.  Eğer\nelmanın fiyatı 1 pul ise, hepimiz bir tane satın alabiliyoruz.  Güzel.\nŞimdi düşün ki, hepimiz 2’şer elma satın almak istiyoruz, ve diyoruz\nki 100 tane daha pul yaratmak iyi bir fikre benziyor.  Böylelikle\nhepimiz 2 tane elmalık pula sahip olacağız.  Sonuç olarak elma başına\n1 pul, değil mi?  Çiftçiye gidiyoruz ve diyoruz ki, 200 elma satın\nalacağız.  Fakat ağaçta hala sadece 100 tane elma var.  Devamında ne\nolur?\nİlk olarak, çiftçi elindeki elma ağacının bir altın madeni olduğunu\ndüşünür, sonuçta herkes elmalarından istiyor.\nArdından iki soru ortaya çıkar:\n\nHer pulun hakiki olduğunu ve sahte\nolmadığını nasıl sağlarız?\nÇok fazla para yaratamamamız için ne\nyapabiliriz?\n"},"2-meraklilar-icin-proje-plani/scarcity":{"title":"2.7 Az ama öz","links":["2-meraklilar-icin-proje-plani/how_much_money","2-meraklilar-icin-proje-plani/proof","2-meraklilar-icin-proje-plani/miners","2-meraklilar-icin-proje-plani/hashes"],"tags":[],"content":"Adadakilerin o resmi pulları boş havadan\nyaratmalarının önüne nasıl gecebiliriz?  Eğer\nsanal şeyler sınırsızca kopyalanabilirse, sınırlılık yaratmak için\nne yapabiliriz?\nVarlıklar eğer etrafta olardan sınırsız veya oldukca bol miktarda\nolmadıkları zaman sınırlıdırlar.  Altın sınırlıdır, hava değildir\n(şansımıza).  Pandalar sınırlıdır (çok kötü), sinekler değildir\n(ayrıca kötü).  Doğal olarak sınırlı olan ve sınırlı olmayan şeyler\nvardır.  Veri, sanal şeklinde, oldukça boldur ve ucuzca kopyalanması\nkolaydır.  Bunu nasıl kopyalayıp yapıştırırım ve kopyalayıp\nyapıştırırım ve kopyalayıp yapıştırırım ve kopyalayıp yapıştırırım ve\nkopyalayıp yapıştırırım bak, bunun bana gideri sıfır.  O halde eğer\nparamızın hem sanal hem de sınırlı olmasını istiyorsak, bizim yapay\nsınırlılık yaratmamız gerek.\nBu sorunu çözmek için iki şeye ihtiyacımız var, ve biri diğeri olmadan\nçalışamaz: bireylerin paramızı yaratırken bir şey harcamalarını\nsağlamalıyız, böylelikle sonsuz miktarda paramızdan\nyaratmaları mümkün olmayacak.  Ve paramıza ait her koinin (ing.:\ncoin) yaratım eyleminin sahtelenememesini sağlamalıyız, böylelikle\ndiğerleri var olan birimleri kopyalayıp sınırsız miktarda üretememeli.\nİlkini madencilik ile üretim sayesinde çözebiliriz.\nİkinicisini ise olağanüstü matematik ile."},"2-meraklilar-icin-proje-plani/proof":{"title":"2.8 Bir şeyin kanıtı","links":[],"tags":[],"content":"Eğer paramızın bedavaya üretilmesinin ve böylelikle oyunumuzun\nbozulmasının önüne geçmek istiyorsak, onu yaratmanın bir giderinin\nolmasını sağlamalıyız.  Her şeyin bir bedeli vardır, doğru bir deyim,\nüç kuruşa beş köfte alamazsın.  Eğer köfteni başkalarından almıyorsan\nbile yiyecek, zaman ve hatta kendi köfteni hazırlamak için ocaktaki\nısıyı tüketiyor olacaksın.\nParamızı beleş olmaktan kurtarmak için, harcanan iş kaniti (ing.:\nproof of work) icat edildi.  Kelimenin tam anlamıyla bu, sisteme\nyaptığın iş için bir şey harcadığını kanitlamak anlamına geliyor.\nBizim örneğimiz olan Monero isimli parada fikir, koin yaratmak isteyen\nkişilerin öncelikle bilgisayarlarında çok zor bir matematik hesabını\nyerine getirmelerini, ve bu hesabı yerine getirdiklerini sisteme\nkanıtlamalarını koşul koymak.\nBilgisayarlar bedavaya gelmedikleri için, ve çalışırken kullandıkları\nelektrik de bedava olmadığı için, bu çözüm bizi boş yere para\nyaratılmasından kurtarıyor.\nZor bir matematik hesabı yaparak karşılığında yeni koinler elde etmeye\nmadencilik ile üretim deniyor.  Tıpkı altın elde etmek için\nyapılan, zaman ve emek alan, madencilik gibi."},"2-meraklilar-icin-proje-plani/miners":{"title":"2.9 Madencilik","links":["1-kullanicilar-icin-kilavuz/mine_monero","1-kullanicilar-icin-kilavuz/getting_monero","2-meraklilar-icin-proje-plani/proof"],"tags":[],"content":"Oyunumuza katılmak için taze yeni koinler isteyen her kişi onları\nmadencilikle\nüretmek zorunda.\nEğer madencilik yapmak istemiyorsan veya yapamıyorsan, elbette onları\nbaşkalarından da\nalabilirsin.\nFakat, günün sonunda geriye doğru baktığında o koinlerin herbirini\nbirisi madencilikle üretmiştir.  Madencilik, oyunumuza yeni koinleri\nsokmanın tek yoludur.\nMadencilikle üretimin işe yaraması için bilgisayarlara hesabı zor\ngelen bir matematik işlemine ihtiyacımız var.  Bu işlemin diğer, yeni\nkatılan bilgisayarlarla da paylaşılabilmesi gerek.  Aksi durumda\nsadece oyunun başında koin yaratabildiğimiz bir para sistemine sahip\nolmuş oluruz.  Böyle bir durum oyunun başındaki kişinin bütün paraya\nsahip olduğu, ve bu sebeple diğerlerinin katılmak istemediği bir oyun\nyaratır.\nMonero’da bu soruna çözüm olarak konulan şey: çok büyük bir sayının\nbölünebildiği bir sayı bulup çözümün sonundaki sıfır sayısının belirli\nbir miktarda olup olmadığını sınamak.  Buradaki en önemli şey, bu\nhesabın önceden belirli bir formülle kesin bir şekilde hesap\nedilemiyor olmasındır.  Bilgisayar kaba kuvvetle her türlü sayıyı\nsırayla denemek ve bu koşulu sağlayan bir çözüm bulmakla uğraşmak\nzorundadır.\nGerçekte bu süreç çekiliş biletleri satın almaya benzer.  Önceden\nkazanan sayının ne olduğunu tahmin edebilmek mümkün değildir,\nvarsayımsal olarak her sayının kazanma şansı aynıdır.  Fakat, kazanma\nşansını artırmak için deneyebileceğin şey olabildiğince fazla\nbilet satın almak olabilir.  Harcanan iş kaniti\nsisteminde bu ya daha fazla sayıda bilgisayar kullanmak ya da daha\ngüçlü bir bilgisayar kullanmak, ya da her ikisini aynı anda yapmaya\nkarşılık gelir.\nAklında tutman gereken bir şey: madencilik sana para veren bir uğraşı\nolduğu için, bunu yaparken rekabetle karşılaşacaksın.  Sonuç olarak\nkim para kazanmak istemez ki?  Ama daha fazla kişinin madencilik\nyapması, veya başka bir deyişle, aynı ödül karşılığı için daha fazla\nbilgisayarın kapışması, veya daha fazla kişinin çekiliş bileti satın\nalması, senin kazanmanı da güçleştirmekte."},"2-meraklilar-icin-proje-plani/index":{"title":"2 meraklılar için proje planı","links":[],"tags":[],"content":""},"3-insanlar-icin-notlar/pressure_valve":{"title":"3.10 Pressure cooker","links":[],"tags":[],"content":"Entropy tends to increase in the universe, disorder naturally grows over time. But disorder is messy. We don’t do well with disorder all the time. There’s one reason while people enjoy while on holidays but eventually feel some relief by coming home.\nDisorder is chaos, it’s inefficient, and in our history it proved to be as needed to foster progress as dangerous to those who lived through it. We strive all the time for certainty, for order. People tend to centralize things to maximize order.\nBut just like a pressure cooker without a safety valve, it boils too much until it explodes. Same goes for financial regulations. Same for tyrannical governments.\nPrivacy allows for usually meek individuals to opt out in silence and release some of that built pressure. Decentralizing what we do is inefficient, it’s messy, but also allows for all the pressure of being ourselves to dissipate more evenly, and not to build so much until we have a earthquake.\nA decentralized and private money makes change possible while keeping it safer, by fostering sincere financial voting and lowering the bar of accumulated pressure so instead of exploding, it releases."},"3-insanlar-icin-notlar/freedom_of_thought":{"title":"3.11 Freedom of thought","links":[],"tags":[],"content":"There is one freedom that nobody can take away from you, at any point of time. It is your freedom of thinking whatever you want.\nSomeone can force you to do anything, even kill yourself, but your innermost sanctuary is your own thought, your own beliefs. This is true, as far as we can keep thinking, we can keep thinking whatever we want.\nBut there has always been a danger lurking. Even though nobody can force us to think something, we’re relatively easy to persuade. It’s even more powerful if we don’t notice it and we believe it was our idea all along. This happened forever, but one of the byproducts of getting better at everything as a society is that we also got better at developing mass persuading tools.\nThe most effective persuasion is done peer to peer. It’s a tailored persuasion by someone that knows us well and therefore knows were the unattended entrances are. Someone we care about, someone we listen to, someone we’d like to impress are the most powerful influencers we could face.\nAt the same time, the most economically effective persuasion is done in masse, of course. Any kind of propaganda, from public massive gatherings, speeches, news outlets, etc. You centralize the production of the message and get a lot of bang for your buck.\nNow, we got to a point where we managed to merge both aspects in one: algorithms. Technologies that are good at getting to know each of us personally and deciding what to show to us to get us to think something in particular. We have a massively deployed system that is planned centrally, yet feels personal. And the thing that makes it all possible is data.\nThe more data a system has about us, the better it gets at persuading us. Artificial intelligence is going to make telling the difference between our free choices and our steered choices way more difficult. The only solution is to feed it less data.\nAnd when it comes to money, only a private form of money is going to protect our usage patterns from being weaponized against us. If we want a humane society, with all the pros and cons it entails, we need to adopt such money. The other option is to slowly then faster descend into a mindless, efficient society where there’s no room left for anything but a shapeless blob of grey human pureé.\nFreedom is a mixed bag, comes with personal victories and hurtful mistakes. But that’s how we managed to be here now."},"3-insanlar-icin-notlar/wake_up":{"title":"3.1 Wake up","links":["3-insanlar-icin-notlar/savings"],"tags":[],"content":"You’re laying on the floor. You smell of burnt ash, grease, and sweat. The noise of the nearby stream reaches you, faint through the foliage and bounces on the entrance of the cove. You can see morning light beams dancing outside, filtered by the foliage. Next to you lies your family, which doesn’t mean the same as it means today. You rise up. You’re not fit, but you’re certainly streamlined. Your body has no excess, all the energy you managed to get in the past has been used to keep going. Your muscles sore from yesterday’s foraging. Your body looks way older than you’d think, based on the years you’ve been alive. Compared to your future descendants, your lifetime is compressed.\nYou know what’s the next thing you’re going to do. You don’t have to think, and your body is telling you anyways. You have to get food.\nMost of your waking hours are dedicated to get food. You could argue the same is conceptually true today. However, this is not merely conceptual, it’s actually looking for, finding, killing or stealing food. You do little else before getting too tired and asleep. Probably mating from time to time, otherwise we wouldn’t be here in the future, writing and reading about it. Very little time is left of your waking hours to anything else that isn’t securing enough fuel so you can do the same the next day. And the next. You’re truly living day-to-day.\nTime to achieve anything new, to try an idea out, to fail, was the scarcest thing around. You’d have to be really good spotting edible fruits and berries, or really good at catching and killing animals with little or no tools available to have extra time.\nToday is a very important day. Inside a bush you feel like you checked a thousand times, there was an inner branch full of beautifully red berries. A hidden, precious pocket of edible fuel in the form of sugar. You grab them, quickly, and eat four of them. How lucky of you. You still have another four left. You’re very smart, so a faint thought forms in the back of your mind: if you don’t eat them now, tomorrow can be as good as a day as today. Tomorrow. That mythical day that doesn’t exist but then, when you wake up again, it does. This is huge. No, really, this is really huge.\nYou invented long time preference. This is the cornerstone of civilization. The ability to think for your future. Some time in the past, our brains got used to the idea of waking up each day, and seeing that the leftovers of last night’s dinner were still there. And that we could eat them, and therefore today you were less hungry because of the food you left yesterday.\nSo you go into the cave, look for a normal-looking stone, and hide the berries below it, inside a folded leave. Today’s the day that for the first time, you saved."},"3-insanlar-icin-notlar/savings":{"title":"3.2 Saved","links":["3-insanlar-icin-notlar/wake_up","2-meraklilar-icin-proje-plani/money_is_a_battery","2-meraklilar-icin-proje-plani/money_rules"],"tags":[],"content":"At first, having more of something than what you needed was an accident. Either by having luck and finding food laying around, managing to kill an animal bigger than expected, or plain stealing it from someone else. But there wasn’t much incentive to have extra anything, most of if was perishable and therefore got stale very fast, or if it was something durable like a tool or extra clothing, it was a burden to transport.\nOn top of that, everything you have in excess makes you a target, so there’s a risk associated with having something extra. It wasn’t like trading with other was super easy either, finding something that you need and the other person don’t, and at the same time something else that works the other way around, is super tricky. That left others in need of your thing with no other resource but to steal it from you, and if you stand in the way of that, attacking you.\nThis was not super cool for us, a bunch of standing mammals with oversize brains. Just like we started to invent language to be able to tell each other complicated stuff, and communicate things that weren’t happening in that precise moment, we ended up inventing money. Money at its core is nothing else but a tool to save that extra something we don’t need right now. If everybody else uses the same money, we can agree that this money is going to be accepted between us in the future. What starts to happen organically, is that if I manage to have more food than I need today, I trade that food for money, the other person gets to eat, and next week, maybe I’m a bit sick and unable to hunt for myself, but I can trade that money again and eating anyway.\nThe act of saving was already possible in some ways, but inventing money supercharged it. People started to realized that it was a better survival strategy to get very good at something that others needed but weren’t so good at. If you are a generalist and therefore a bit good at everything, the moment you can’t perform (because you’re ill for example) or the conditions get above your skill (harder prey to hunt), you’re doomed. But if you are the best medic of the group, you don’t need to even hunt, you can trade your skills for money, and when you need food, that money for food.\nSaving made us specialize. And with specialization, we went from basic mode to advance. We developed better tools to make our specialized work even more efficient, better communications to be able to reach further and further away, and thanks to those advances, we died less often.\nOne of those tools we made better and better every time was money itself. Money allowed more and more efficient trading and saving, is one of the technologies that made so many of us being here today possible. So if we can keep inventing better money, we can keep propelling ourselves to better lives."},"3-insanlar-icin-notlar/is_this_money":{"title":"3.3 Is Monero money?","links":["2-meraklilar-icin-proje-plani/good_money"],"tags":[],"content":"Yes it is.\nDon’t get lost in philosophic or etymological discussions. If it walks and talks like a duck, it’s probably a duck. If you earned it with your work, and you saved it for a while, and you spend it to buy something else, then it works like money. And something that works like money is… you guessed it: money.\nUse your scarce time on this planet to breathe, not argue if we should call the air… air."},"3-insanlar-icin-notlar/personal_choice":{"title":"3.4 A personal choice","links":[],"tags":[],"content":"A transaction should be a personal choice. Giving something out should be something an individual decides to do willingly.\nFor that to the true, the individual must have ownership of the thing to be given.\nTo have true ownership, both the person and the asset have to be resistant to censorship.\nTo be censorship-resistant, both secrecy and freedom are required.\nFor the person, secrecy means nobody knows who you are, therefore nobody can force you to do anything against your will. Freedom means you can move freely from place to place, in case someone wants to force you by not giving you any other option.\nFor the asset, secrecy means nobody can see the transaction and follow it back to you, voiding the previous point. Freedom means self-custody, so nobody can spend or use your funds without even needing to force you in the first place.\nIf we lose the previous properties, then it’s not a choice. If it’s not a choice, more often than not it won’t be aligned to our own interests. If we multiply that by millions, we end up with a few powerful individuals deciding for the rest of us.\nThe probability of most of us being happy in such scenario is very small. So, we need to work towards maintaining such sentence a reality: A transaction should be a personal choice."},"3-insanlar-icin-notlar/fresh_start":{"title":"3.5 A fresh start","links":["3-insanlar-icin-notlar/personal_choice","3-insanlar-icin-notlar/trying_things","2-meraklilar-icin-proje-plani/value_vs_price"],"tags":[],"content":"The internet gave us freedom to explore being someone else. Then, and only willingly, bring that new self back into the real world, updated. A different identity is a tool we can use to change our current one.\nIt’s like gaining higher ground to see what may be ahead and deciding if a path is better for us or not. Being private reduces friction from trying. It’s like asking for a time out in the middle of a match and consider your options.\nIdentities formed in base of our true desires and interests will foster connections to people that make our lives better for us, to jobs that are a genuine fit for us, to knowledge that boosts our chances to feel our lifes balanced, and worth living.\nThese identities have the chance to spill over, either gradually or in a sweep, to our meat space identities.\nIf all those interactions are monitored, we face having too much risk and not daring to try. Or make it very difficult to even create such identity because of its ties to our current one.\nAnd if money is the language of value, private money ensures that valuation censorship is gone and we can add money to the toolbelt of that new identity."},"3-insanlar-icin-notlar/trying_things":{"title":"3.6 Trying things out","links":["3-insanlar-icin-notlar/honest_opinion","3-insanlar-icin-notlar/wisdom_of_the_crowd"],"tags":[],"content":"The first picture that comes to our minds when we think about censorship is censorship by force.\nAn evil Orwellian government sending the police to knock down the doors of those who do not comply with the current speech law, regardless of that law being good or bad.\nBut there’s a less discussed yet maybe even more pervasive phenomenon, self-censorship. When we’re being observed, we behave differently. Privacy is the freedom to try things out.\nIn many ways, we already live inside the Truman Show. Once you realize that, how much would you stop being yourself? How many things would you like to try, but won’t because of that peer pressure?\nWhy is this important? Because trying stuff is essential to discover new things. Even AI works like this. It makes errors all the time and corrects course until it finds an outcome that works. AI improves so far because it’s not only a tireless human, it’s a shameless human.\nBut trying things in the clear, completely naked, set the risk too high for most people. Is that ability to try new things in a permission-less way (that means without the approval of someone already more powerful than us) makes us resistant to central planning.\nThat decentralizes things. Decentralization is important for optimizing the outcome of our very lives. Nobody is individually perfect. But collectively we get closer to getting things right.\nIn the future, more and more of that aggregated set of guesses will be recorded and analyzed. They will be part of our profiling, and we will be very aware of that. That will cause us to not answer truthfully individually. And so we’ll get it wrong collectively.\nWe’re voting all the time with our money.\nWe already learned that anonymous voting is the best voting.\nWe need to preserve that anonymous voting when it comes to our money.\nBecause that right to be wrong more often, will allow us to get it right together."},"3-insanlar-icin-notlar/honest_opinion":{"title":"3.7 Honest opinion","links":["3-insanlar-icin-notlar/wisdom_of_the_crowd"],"tags":[],"content":"In the Asch conformity experiments they put a person in a room together with other seven fake participants. Just like a ring signature, one true mixed up with many decoys Then they show them all a picture with three vertical lines of very obvious different lengths, and ask: ¿What line is equal to the first line, A, B or C?\nEven though there’s a clear correct answer, if the fake participants answer out loud first, and say A for example, the real participant answering last, will give the same wrong answer a third of the time. If you run the experiment 12 times, 75% of them conform to the peer pressure at least once.\nIt proved that we care a lot not to go against the current. We love validation from the group. We don’t want to stand out. It may even prove that some people actually believed they were seeing lines wrong.\nThink about it and the way that people would behave on a perfectly transparent spending paradigm. We’d go downhill very fast. We should aim for the right answer, not the most popular one."},"3-insanlar-icin-notlar/wisdom_of_the_crowd":{"title":"3.8 Wisdom of the crowd","links":["3-insanlar-icin-notlar/personal_choice","3-insanlar-icin-notlar/honest_opinion","2-meraklilar-icin-proje-plani/randomx","2-meraklilar-icin-proje-plani/good_money"],"tags":[],"content":"In the candy jar experiment, we fill a glass jar with a lot of candies or pebbles or anything that would be difficult to guess the number of by only looking. None of us is super accurate guessing how many candies are in the jar, but if we take the median of all our guesses, it’s impressively accurate. This candy jar experiment as been replicated with variants many many times, and the bigger the number of participants, the more accurate the guess gets.\nWhile this proves the wisdom of the crowd, it only works if everybody chooses freely. And one of the ways people won’t guess freely is peer pressure. We are guessing the value of things all the time. By buying and selling, either stuff or our time in a job, we’re broadcasting to each other how much we value what we have and what we want.\nOf course if we don’t even have permission to guess freely, it’s even worse. Monetary restrictions all over the world prove that again and again.\nOnly truly decentralized forms of money can look resistant to censorship, and only private forms of money can be truly resistant to censorship. A private, decentralized money is necessary for our collective wisdom to reach its potential."},"3-insanlar-icin-notlar/strings_attached":{"title":"3.9 The price of strings","links":["1-kullanicilar-icin-kilavuz/send_monero","1-kullanicilar-icin-kilavuz/gift_monero","2-meraklilar-icin-proje-plani/value_vs_price"],"tags":[],"content":"Giving money to someone should not have strings attached. When you gift with a money that allows you to trace everything the receiver does afterwards (and possible before the fact as well) is a poisoned gift.\nCan it be consider a gift, or are you just paying for information? The only way to avoid this is using an amnesic kind of money that doesn’t remember.\nForget about the gift. Let’s say you’re paying for something. If you’re getting something extra (the recipient’s financial information), what would be the fair price of that? Should you pay more for the privilege?\nIn that case, using money that is not private should be more expensive. Or putting it the other way around, pay with a private money should be cheaper than anything else."},"3-insanlar-icin-notlar/index":{"title":"3 insanlar için notlar","links":[],"tags":[],"content":""},"index":{"title":"Monero Bahçesine Hoşgeldin","links":["1-kullanicilar-icin-kilavuz/get_started","2-meraklilar-icin-proje-plani/lets_do_it","3-insanlar-icin-notlar/wake_up"],"tags":[],"content":"Kendini küçük ve paslı bir demir parmaklı kapıdan geçerken hayal et.\nKapı sonuna kadar açık, ve kapıdan geçerken sarı pirinç bir plaka\nüzerinde Monero Bahçesi yazan bir tabela görüyorsun.  Tanınmamış\nkuşlara ait hafif\nsesler\nkulaklarına varıyor, önünde rüzgarla eğilip açılan çimeni görüyorsun.\nİlk bakışta karmaşık bir örgü oluşturan desenler onlara tekrar\nbaktığın zaman üç ana kola ayrılan patikalara dönüşüyor.\nKullanıcılar için kılavuz\n(Nasıl kullanırım) Eğer ihtiyacın olan, nasıl çalıştığına bakmadan,\nne sebeple yaratıldığını anlamadan, sadece Monero’yu kullanmaksa,\nburadan başla.\nMeraklılar için proje planı\n(Nasıl çalışır) Bu patika seni tepeye çıkan yola götürüp Monero’nun\nnasıl çalıştığını gösterecek.  Haydi parça parça inceleyerek, sıfırdan\nbir sanal para yaratalım.\nİnsanlar için notlar\n(Neden onemli) Monero yeni bir dünyayı mümkün etmek için çok\nkullanışlı olan özelliklere sahip.  Bu patika senin aklını harekete\ngeçirecek.\n\nBu bahçede gezinmenin doğru veya yanlış yolu yok.  Önünde çakıl\ntaşlarıyla bezeli kuru topraktan üç patika var.  Etrafında daha önce\ngörmediğin yeşil bitkiler…  Patikaların kısa tariflerine göz\natarken içindeki merak duygusunun çoktan uyanmakta olduğunu\nhissediyorsun.\nTıkla sadece, ve keyfini çıkar."}}